const { default: mongoose, Schema } = require("mongoose");
const { db_url } = require("../../../../../configs/db.config");
const Model = require("../model/model");

let data = [
	
	{
		title: "টিকা দান",
		description: "<p>আগামীকাল সোমবার (২১ জুন) রাজধানীর তিনটি হাসপাতালে ফাইজার-বায়োএনটেকের করোনা টিকা প্রদান কার্যক্রম শুরু হবে। প্রাথমিকভাবে বঙ্গবন্ধু শেখ মুজিব মেডিকেল বিশ্ববিদ্যালয়, শেখ রাসেল গ্যাস্ট্রোলিভার হাসপাতাল এবং কুর্মিটোলা জেনারেল হাসপাতালে ১২০ জন করে মোট ৩৬০ জনকে টিকা দেয়া হবে।</p>",
		date: "2023-06-14T00:00:00.000+00:00",
	},
	{
		title: "চাল বিতরন",
		description: "<p>খাদ্যবান্ধব কর্মসূচির সুবিধাভোগীদের কাছে চাল বিতরণের তথ্য মোবাইলে এসএমএসের মাধ্যমে দেয়ার সিদ্ধান্ত নিয়েছে সরকার। ‘খাদ্যবান্ধব কর্মসূচি’র আওতায় সারাদেশে ৫০ লাখ হতদরিদ্র পরিবারকে খাদ্য সহায়তা দিচ্ছে সরকার। এসব পরিবারকে প্রতি মাসে ১০ টাকা কেজি দরে ৩০ কেজি করে চাল দেয়া হচ্ছে।</p>",
		date: "2023-06-14T00:00:00.000+00:00",
	},
	{
		title: "কার্ড বিতরন",
		description: "<p>খাদ্যবান্ধব কর্মসূচির সুবিধাভোগীদের কাছে চাল বিতরণের তথ্য মোবাইলে এসএমএসের মাধ্যমে দেয়ার সিদ্ধান্ত নিয়েছে সরকার। ‘খাদ্যবান্ধব কর্মসূচি’র আওতায় সারাদেশে ৫০ লাখ হতদরিদ্র পরিবারকে খাদ্য সহায়তা দিচ্ছে সরকার। এসব পরিবারকে প্রতি মাসে ১০ টাকা কেজি দরে ৩০ কেজি করে চাল দেয়া হচ্ছে।</p>",
		date: "2023-06-14T00:00:00.000+00:00",
	},
	{
		title: "চাল বিতরন",
		description: "<p>খাদ্যবান্ধব কর্মসূচির সুবিধাভোগীদের কাছে চাল বিতরণের তথ্য মোবাইলে এসএমএসের মাধ্যমে দেয়ার সিদ্ধান্ত নিয়েছে সরকার। ‘খাদ্যবান্ধব কর্মসূচি’র আওতায় সারাদেশে ৫০ লাখ হতদরিদ্র পরিবারকে খাদ্য সহায়তা দিচ্ছে সরকার। এসব পরিবারকে প্রতি মাসে ১০ টাকা কেজি দরে ৩০ কেজি করে চাল দেয়া হচ্ছে।</p>",
		date: "2023-06-14T00:00:00.000+00:00",
	},
	{
		title: "তেল বিতরন",
		description: "<p>খাদ্যবান্ধব কর্মসূচির সুবিধাভোগীদের কাছে চাল বিতরণের তথ্য মোবাইলে এসএমএসের মাধ্যমে দেয়ার সিদ্ধান্ত নিয়েছে সরকার। ‘খাদ্যবান্ধব কর্মসূচি’র আওতায় সারাদেশে ৫০ লাখ হতদরিদ্র পরিবারকে খাদ্য সহায়তা দিচ্ছে সরকার। এসব পরিবারকে প্রতি মাসে ১০ টাকা কেজি দরে ৩০ কেজি করে চাল দেয়া হচ্ছে।</p>",
		date: "2023-06-14T00:00:00.000+00:00",
	},
	
];

module.exports = async () => mongoose.connect(db_url)
	.then(async () => {
		console.log("\n");
		console.log("union porishod notice seeding");

		await Model.deleteMany({});
		for (let i = 0; i < data.length; i++) {
			await Model.create(data[i]);
		}

		// let response = await Model.insertMany(data);

		console.log("union porishod notice seeding complete");

		console.log("\n");
	});
