const { default: mongoose, Schema } = require("mongoose");
const { db_url } = require("../../../../../configs/db.config");
const Model = require("../model/model");
const blogCategoriesModel = require("../../blog_categories/model/model");

var uni = [];
const gen_rand = () => {
	let rand = Math.floor(Math.random() * 7);
	if (rand == 0 || uni.includes(rand)) {
		rand = gen_rand();
	}
	uni.push(rand);
	return rand;
};

async function getId() {
	// Get a random entry
	var random = gen_rand();
	var data = await blogCategoriesModel.find().limit(1).skip(random);
	// console.log(random, data[0]._id);
	return [data.map(i => i._id), "655dc56cdfef49c66bc28b5f"];
}

// node app/api/blog/blogs/seeder/seeder.js
// console.log("hi hello");


let data = [

	// সংবাদ

	{
		title: "কেমন আছেন আল মাহমুদ",
		subtitle: "আল মাহমুদের মতো কবি যুগে যুগে জন্মায় না। বহু প্রতীক্ষার পর একজন বড় কবির আবির্ভাব ঘটে। একটি জাতির জন্য এটি…",
		short_description: `<p>আল মাহমুদের মতো কবি যুগে যুগে জন্মায় না। বহু প্রতীক্ষার পর একজন বড় কবির আবির্ভাব ঘটে। একটি জাতির জন্য এটি গৌরবের। </p>`,
		description: `তিনি কবিতার জগতে এতটা উচ্চতায় নিয়েছেন নিজেকে যে, তাকে নিয়ে লিখতেই হয়। বলতেই হয়। আড্ডায় আসরে আলোচনায় তাকে উচ্চারণ করতে হয়। উপমা দিতে হয় তার কথা। তার কবিতা থেকে দিতে হয় উদাহরণ। তিনি নিজেকে নির্মাণ করেছেন তিলে তিলে। তার নির্মিত কাব্যিক প্রাসাদ বেশ উঁচু। তাকে অবহেলা করার কিছু নেই। অবজ্ঞারও নেই কিছু। তার যত নাম অনাম সুনাম বদনামÑ সবই কবিতা ঘিরে। প্রশংসা-নিন্দাও কবিতার জন্যই। তিনি কবি এবং একজন অসাধারণ কবি। তিনি আল মাহমুদ।

		ক’দিন ধরে বেশ কিছু পত্রিকা, অনলাইন, নিউজ পোর্টাল এবং ফেসবুকে বেশ লেখালেখি দেখেছি আল মাহমুদকে ঘিরে। তিনি লেখার বিষয়। তাকে নিয়ে লিখতেই হয়। লিখতে হবে। কথায় আছে, মৃত্যুর পরও পৃথিবীতে বেঁচে থাকার উপায় দু’টি অথবা দু’টির যেকোনো একটি। হয় এমন কিছু লিখে যাও, যা মানুষ পড়বে। অথবা এমন কিছু করে যাও মানুষ লিখবে। তার মানে অক্ষরে জেগে থাকা ছাড়া বেঁচে থাকার আর কোনো পথ নেই। আল মাহমুদ শব্দের আনন্দে যা নির্মাণ করেছেন, তা মানুষকে পড়তে হয়। হয়তো পড়তে হবে আগামী প্রজন্মকেও। পাশাপাশি তার লেখালেখি কর্মের গৌরব নিয়ে লিখতেও হবে। সুতরাং তাকে নিয়ে লেখালেখি হবে এটা খুবই স্বাভাবিক।
		কিন্তু বিভিন্নভাবে এ ক’দিন যেভাবে লেখালেখি হয়েছে তা স্বাভাবিক নয়। কোথাও মিথ্যের ছড়াছড়ি। কোথাও বিবেকহীনতা রয়েছে। একটি অনলাইন নিউজ করেছে- আল মাহমুদ গ্রামের বাড়িতে পড়ে আছেন নিঃসঙ্গ। তিনি অবহেলার শিকার। তাকে দেখাশোনার কেউ নেই। তার ছেলেরাও দেখছে না। কেউ নিউজ করেছেন- আল মাহমুদের অবস্থা করুণ। তার যথার্থ যত্ন নিচ্ছে না কেউ। অতি আবেগ থেকে কেউ কেউ বিছানায় শায়িত অথবা ঘুমন্ত আল মাহমুদের ছবি পোস্ট করেছেন ফেসবুকে। লিখেছেন- দেখুন, কী করুণ আল মাহমুদ! এসব মিথ্যা বানোয়াট ও উদ্দেশ্যমূলক খবর এবং অবিবেচক ও মাত্রাজ্ঞানহীন নিউজ একজন কবির পক্ষে অবশ্যই সম্মানজনক নয়।</p>`,
		photo: "uploads/posts/1.jpg",
		photo_alt_text: "photo",
		seo_title: "আল মাহমুদ",
		seo_keyword: "আল মাহমুদ",
		seo_description: "আল মাহমুদ",
		seo_schema_tags: "আল মাহমুদ",
		published_date: "2023-06-14",
		categories: ['65769b274825174d9fd67bad'],
		comments:[],
		status: true,

	},
	{
		title: "মহাকাব্য প্যারাডাইস লস্ট ও জন মিলটন",
		subtitle: "১৬০৮ সালের ৯ ডিসেম্বর ইংল্যান্ডের লন্ডন শহরের ব্রেড স্ট্রিটে জন্মগ্রহণ করেন ইংরেজি সাহিত্যের অন্যতম শ্রেষ্ঠ কবি জন মিলটন। তিনি ইংরেজি",
		short_description: `<p>১৬০৮ সালের ৯ ডিসেম্বর ইংল্যান্ডের লন্ডন শহরের ব্রেড স্ট্রিটে জন্মগ্রহণ করেন ইংরেজি সাহিত্যের অন্যতম শ্রেষ্ঠ কবি জন মিলটন। </p>`,
		description: `<p>১৬০৮ সালের ৯ ডিসেম্বর ইংল্যান্ডের লন্ডন শহরের ব্রেড স্ট্রিটে জন্মগ্রহণ করেন ইংরেজি সাহিত্যের অন্যতম শ্রেষ্ঠ কবি জন মিলটন। তিনি ইংরেজি সাহিত্যের অন্যতম প্রধান ও প্রভাবশালী কবি। শেক্সপিয়ারের পরেই যার স্থান বলে মনে করেন অনেকে। স্কুলের ছাত্র থাকাকালে মিলটন নিয়মিত পড়াশোনার পাশাপাশি লাতিন, গ্রিক, হিব্রু ভাষা ও সাহিত্য অধ্যয়ন করেন। সেই সাথে কাব্যচর্চাও শুরু করেন। ১৬২৬ সালে কলেজে পড়ার সময় তার প্রথম কবিতা প্রকাশিত হয়। তার সবচেয়ে বিখ্যাত ও কালোত্তীর্ণ সৃষ্টি মহাকাব্য Paradise Lost। এ ছাড়া তার রচিত উল্লেখযোগ্য রচনাসমূহ হচ্ছে- কবিতাগ্রন্থ লাইসিডাস, প্যারাডাইস রিজেন্ট, স্যামসন এনিস্তে, লা এলেগ্র,কাব্যনাটক কমাস,গদ্য রচনা অব এডুকেশন, এরিওপোজিটিকা বিশেষভাবে উল্লেখযোগ্য।
		প্যারাডাইজ লস্ট মহাকাব্যটি মিলটনের সময় থেকে আজ অবধি ইংরেজ সাহিত্য-সমালোচনার কেন্দ্রেই রয়ে গেছে। ১৬৫৮ থেকে ১৬৬৪ সালের মধ্যে মিলটন তার মহাকাব্য প্যারাডাইজ লস্ট রচনা করেন।</p>`,
		photo: "uploads/posts/2.jpg",
		photo_alt_text: "photo",
		seo_title: "জন মিলটন",
		seo_keyword: "জন মিলটন",
		seo_description: "জন মিলটন",
		seo_schema_tags: "জন মিলটন",
		published_date: "2023-07-11",
		categories: ['65769b274825174d9fd67bad', '65618a3394f36f64bfe54d46'],
		comments:[],
		status: true,

	},
	{
		title: "নির্জনতার কবি জীবনানন্দ দাশের জন্মদিনে",
		subtitle: "আমি কবি, সেই কবি-আকাশে কাতর আঁখি তুলি হেরিঝরাপালকের ছবি’ আজ নির্জনতার কবি জীবনানন্দ দাশের ১২৩তম জন্মদিন। রূপসী বাংলার কবি ১৯৯৯…",
		short_description: `<p>
		আজ নির্জনতার কবি জীবনানন্দ দাশের ১২৩তম জন্মদিন। রূপসী বাংলার কবি ১৯৯৯ সালের ১৭ ফেব্রুয়ারি বরিশাল জেলায় জন্মগ্রহণ করেন।</p>`,
		description: `<p>জীবনানন্দ বরিশাল ব্রজমোহন স্কুল থেকে ম্যাট্রিক (১৯১৫), বি এম কলেজ থেকে আইএ (১৯১৭) এবং কলকাতার প্রেসিডেন্সি কলেজ থেকে ইংরেজিতে অনার্সসহ বি.এ (১৯১৯) ও ইংরেজিতে এম.এ (১৯২১) পাস করেন। আইন কলেজে ভর্তি হলেও শেষ পর্যন্ত তিনি পরীক্ষা দেননি।


		জীবনানন্দ কলকাতা সিটি কলেজে ১৯২২ সালে ইংরেজি সাহিত্যে অধ্যাপনা শুরু করেন। ১৯২৯ সালে তিনি সদ্য প্রতিষ্ঠিত বাগেরহাট প্রফুল্লচন্দ্র কলেজে যোগ দেন, কিন্তু কিছু দিন পর চাকরি ছেড়ে কলকাতায় চলে যান। ওই বছরই (১৯২৯) তিনি দিল্লির রামযশ কলেজে যোগ দেন, ১৯৩০-এ আবার দেশে প্রত্যাবর্তন করেন। </p>`,
		photo: "uploads/posts/3.jpg",
		photo_alt_text: "photo",
		seo_title: "জীবনানন্দ দাশ",
		seo_keyword: "জীবনানন্দ দাশ",
		seo_description: "জীবনানন্দ দাশ",
		seo_schema_tags: "জীবনানন্দ দাশ",
		published_date: "2023-07-11",
		categories: ['65769b274825174d9fd67bad', '65618a3394f36f64bfe54d46'],
		comments:[],
		status: true,

	},
	{
		title: "‘কবি মল্লিক বাংলা গানের জগতে উজ্জ্বল নক্ষত্র’",
		subtitle: "গীতিকার, কবি ও সংগঠক আ জ ম ওবায়দুল্লাহ বলেছেন, মতিউর রহমান মল্লিক বাংলা গানের জগতে একটি উজ্জ্বল নক্ষত্র। যে নক্ষত্রের",
		short_description: `<p>যে নক্ষত্রের আলো বাংলা ভাষা ও সাহিত্য এবং বাঙালি জাতি যত দিন এই পৃথিবীতে থাকবে, তত দিন জ্বলতে থাকবে।</p>`,
		description: `<p>বাংলাদেশ কালচারাল একাডেমির চেয়ারম্যান বাচিক শিল্পী শরীফ বায়জীদ মাহমুদের সভাপতিত্বে এ অনুষ্ঠানে স্বাগত বক্তব্য রাখেন একাডেমির সেক্রেটারি কবি ইবরাহিম বাহারী।

		শুভেচ্ছা বক্তব্য রাখেন কবি আসাদ বিন হাফিজ, গীতিকার অধ্যাপক আবু তাহের বেলাল, কবি শহীদ সিরাজী প্রমুখ।
		
		সভাপতির বক্তব্যে শরীফ বায়জীদ মাহমুদ বলেন, আমাদের সাংস্কৃতির চর্চার লক্ষ্য শুধুমাত্র চিত্ত বিনোদন নয়,আমাদের লক্ষ্য চিত্ত পরিশুদ্ধ করা। কবি মতিউর রহমান মল্লিকের গান কবিতায় চিত্ত পরিশুদ্ধ করার সমৃদ্ধ উপাদান আছে।</p>`,
		photo: "uploads/posts/4.jpg",
		photo_alt_text: "photo",
		seo_title: "কবি মল্লিক",
		seo_keyword: "কবি মল্লিক",
		seo_description: "কবি মল্লিক",
		seo_schema_tags: "কবি মল্লিক",
		published_date: "2023-07-11",
		categories: ['65769b274825174d9fd67bad', '65618a3394f36f64bfe54d46'],
		comments:[],
		status: true,

	},
	{
		title: "আরবি নিউজ অনুবাদ শেখার অনবদ্য বই ‘মিডিয়া আরবি শিখি’",
		subtitle: "কোরআন-হাদিস চর্চার পাশাপাশি আরবি শিক্ষার্থীদের মধ্যে ইদানিং আরবি পত্র-পত্রিকা পাঠ ও সেখান থেকে নিউজ অনুবাদের আগ্রহ আগের যেকোনো সময়ের তুলনায়",
		short_description: `<p>কোরআন-হাদিস চর্চার পাশাপাশি আরবি শিক্ষার্থীদের মধ্যে ইদানিং আরবি পত্র-পত্রিকা পাঠ ও সেখান থেকে নিউজ অনুবাদের ।</p>`,
		description: `<p>বইটি প্রকাশের আগে তাতে থাকা প্রতিটি নিউজ লেখকের ফেসবুকে দেয়া হতো, তখন থেকেই আরবি নিউজ অনুবাদের সাথে সম্পৃক্ত তরুণরা তাকে একটি বই করার আহবান জানান। সেখান থেকে অনুপ্রাণিত হয়েই শফিকুল ইসলাম আল ইমদাদীর ‘মিডিয়া আরবি শিখি’-এর জন্ম।


		নিউজ অনুবাদের সাথে সম্পৃক্ত একাধিক তরুণ বইটি সম্পর্কে জানিয়েছেন, আগের বইগুলোর চেয়ে এটি বেশ সহজ ও সাবলীল। অধিক প্রয়োজনীয় ও তুলনামূলক সহজ নিউজগুলো পূর্ণাঙ্গ অনুবাদের পাশাপাশি শব্দে শব্দেও অনুবাদ করা হয়েছে, যা অনুবাদের প্রাথমিক শিক্ষার্থীর জন্য খুবই উপকারী ও ফলদায়ক হবে। সে হিসেবে এ পর্যন্ত বাংলায় রচিত অনুবাদের অন্যান্য বইয়ের চেয়ে এটি অনন্য ও অনবদ্য।</p>`,
		photo: "uploads/posts/5.jpg",
		photo_alt_text: "photeo",
		seo_title: "আরবি নিউজ",
		seo_keyword: "আরবি নিউজ",
		seo_description: "আরবি নিউজ",
		seo_schema_tags: "আরবি নিউজ",
		published_date: "2023-07-01",
		categories: ['65769b274825174d9fd67bad'],
		comments:[],
		status: true,

	},
	{
		title: "মানবজীবনে ট্র্যাজেডি",
		subtitle: "মৃত্যুর আগ পর্যন্তু মানুষের বেঁচে থাকাকে বলা হয় মানবজীবন। জগতের শ্রেষ্ঠ জীবন মানবজীবন। অন্যান্য প্রাণী থেকে মানুষ এ জন্য আলাদা",
		short_description: `<p>মৃত্যুর আগ পর্যন্তু মানুষের বেঁচে থাকাকে বলা হয় মানবজীবন। জগতের শ্রেষ্ঠ জীবন মানবজীবন।</p>`,
		description: `<p> কিছু মানুষ রয়েছে যারা সারা জীবনই সুখ ভোগ করতে পারে আর কিছু মানুষ রয়েছে সারা জীবনই দুঃখ-কষ্টে বেঁচে থাকেন। কোনো মানুষের জীবনে কোনো একসময় সুখ ধরা দিতে পারে আবার দুঃখও তেমনি করে হঠাৎ জীবনের দরজায় কড়া নাড়তে পারে। সুখ ও দুঃখ এভাবেই নিজ নিজ গন্তব্য ঠিক করে নিয়ে আবর্তিত হতে থাকে। সুখ কী আর দুঃখইবা কাকে বলে এ নিয়েও বিস্তর মতপার্থক্য রয়েছে। তবে ছোট ছোট সুখ এবং ছোট ছোট দুঃখের কোনো সংজ্ঞা দেয়া যায় না। এগুলো আপেক্ষিক। বড় বড় দুঃখের সংজ্ঞা না হলেও সেসব দুঃখকে দেখা যায়। ছোট ছোট সুখ; ছোট ছোট দুঃখ প্রায় সব মানুষের মধ্যেই কমবেশি অবস্থান করে। কিন্তু বড় বড় সুখ ও বড় বড় দুঃখ বাসা বাঁধতে পারে বড় বড় মানুষের জীবনে। মহৎ ব্যক্তিত্বের সুখ ও দুঃখ আস্বাদনের মাত্রা সাধারণ মানুষের তুলনায় ভিন্নতর হয়ে থাকে। জীবনবোধের অনুভূতি যত গভীর হয় সুখ ও দুঃখ বোধের পরিমাণও ততই গভীর হতে পারে। পাহাড়কে নিশ্চিহ্ন করতে বড় শক্তির প্রয়োজন পড়ে।</p>`,
		photo: "uploads/posts/6.jpg",
		photo_alt_text: "photo2",
		seo_title: "মানবজীবনে ট্র্যাজেডি",
		seo_keyword: "মানবজীবনে ট্র্যাজেডি",
		seo_description: "মানবজীবনে ট্র্যাজেডি",
		seo_schema_tags: "মানবজীবনে ট্র্যাজেডি",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bad','65769b274825174d9fd67baf'],
		comments:[],
		status: true,

	},

	// সামাজিক সেবা

	{
		title: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		subtitle: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম হলো এমন একটি পরিকল্পনা বা প্রক্রিয়া যা নিয়েছে উন্নতি এবং সামাজিক উন্নয়নের লক্ষ্যে সাম্প্রদায়িক সম্প্রেক্ষে একটি নির্দিষ্ট অঞ্চলে বা সমাজে চালানো হয়।",
		short_description: `<p>সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম হলো এমন একটি পরিকল্পনা বা প্রক্রিয়া যা নিয়েছে উন্নতি ।</p>`,
		description: `<p>সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম হলো এমন একটি পরিকল্পনা বা প্রক্রিয়া যা নিয়েছে উন্নতি এবং সামাজিক উন্নয়নের লক্ষ্যে সাম্প্রদায়িক সম্প্রেক্ষে একটি নির্দিষ্ট অঞ্চলে বা সমাজে চালানো হয়। এই প্রোগ্রামগুলি সাধারণত শিক্ষা, স্বাস্থ্য, অর্থনৈতিক উন্নয়ন, সামাজিক সমস্যা সমাধান, পরিবেশ সংরক্ষণ, কৃষি ও গ্রামীণ উন্নয়ন ইত্যাদির মাধ্যমে সাম্প্রদায়িক উন্নয়নে মানুষের জীবনস্তর বাড়াতে হয়।

		এই প্রোগ্রামগুলির মাধ্যমে অনেক ধরনের কাজ করা হয়, যেমনঃ১. শিক্ষা ও প্রশিক্ষণ: সাম্প্রদায়িক উন্নয়নের প্রোগ্রাম যাতে শিক্ষা এবং প্রশিক্ষণের সুযোগ প্রদান করে।
		২. স্বাস্থ্য ও পরিবেশ সংরক্ষণ: সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম যাতে স্বাস্থ্য সেবা প্রদান করা হয় এবং পরিবেশ সংরক্ষণে প্রচেষ্টা করা হয়।
		৩. অর্থনৈতিক উন্নয়ন: আর্থিক সম্পদ ও উন্নয়নে সামাজিক উন্নয়নের প্রোগ্রাম যাতে সম্প্রদায় উন্নতি করতে পারে।
		৪. গ্রামীণ উন্নয়ন: গ্রামীণ অঞ্চলে উন্নয়নের প্রোগ্রাম যাতে গ্রামীণ সমাজের উন্নতি সম্পর্কে কাজ করা হয়।এই প্রোগ্রামগুলি সাম্প্রদায়িক সম্প্রেক্ষে মানুষের সামাজিক, আর্থিক এবং পরিবেশ সম্পর্কে বিভিন্ন সেক্টরে সহায়তা ও উন্নয়নের প্রয়োজনীয় পদক্ষেপ গ্রহণ করে।</p>`,
		photo: "uploads/posts/s1.jpg",
		photo_alt_text: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		seo_title: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		seo_keyword: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		seo_description: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		seo_schema_tags: "সাম্প্রদায়িক উন্নয়ন প্রোগ্রাম",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb1', '65769b274825174d9fd67bb5'],
		comments:[],
		status: true,

	},
	{
		title: "শিক্ষা ও দক্ষতা উন্নয়ন",
		subtitle: "শিক্ষা ও দক্ষতা উন্নয়ন হলো এমন প্রক্রিয়া বা কর্মসূচি যার মাধ্যমে মানুষদের শিক্ষার অংশগ্রহণ এবং দক্ষতা উন্নয়ন হয়। ",
		short_description: `<p>শিক্ষা ও দক্ষতা উন্নয়ন হলো এমন প্রক্রিয়া বা কর্মসূচি যার মাধ্যমে মানুষদের শিক্ষার অংশগ্রহণ এবং দক্ষতা উন্নয়ন হয়।</p>`,
		description: `<p>শিক্ষা ও দক্ষতা উন্নয়ন হলো এমন প্রক্রিয়া বা কর্মসূচি যার মাধ্যমে মানুষদের শিক্ষার অংশগ্রহণ এবং দক্ষতা উন্নয়ন হয়। এটি একটি প্রাথমিক এবং অত্যন্ত গুরুত্বপূর্ণ কার্যক্রম যা বিভিন্ন স্তরের মানুষের শিক্ষার মাধ্যমে তাদের দক্ষতা এবং জ্ঞানের বৃদ্ধি করে।
		শিক্ষা ও দক্ষতা উন্নয়নে সাধারণত নিম্নলিখিত কাজগুলি অন্তর্ভুক্ত থাকে:১. প্রাথমিক ও মাধ্যমিক শিক্ষা: বাচ্চাদের জন্য শিক্ষার আধারভূত মাধ্যমিক শিক্ষা প্রদান।
		২. উচ্চ শিক্ষা: বিশ্ববিদ্যালয়ের মাধ্যমে প্রফেশনাল ও বিষয়াগত শিক্ষা প্রদান।
		৩. প্রশিক্ষণ ও কাজের দক্ষতা: কাজের দক্ষতা ও প্রশিক্ষণ দিয়ে যে কোনও নিয়োগ বা পেশা সংক্রান্ত দক্ষতা উন্নয়ন।
		৪. প্রশিক্ষণ ও সেমিনার: নতুন বিষয়ের জন্য প্রশিক্ষণ ও সেমিনার অনুষ্ঠান করা।
		৫. পেশাদার শিক্ষা: বিভিন্ন পেশার সম্পর্কে বিশেষজ্ঞতা অর্জনের জন্য শিক্ষার সুযোগ উন্নত করা।শিক্ষা ও দক্ষতা উন্নয়নের মাধ্যমে মানুষের মানসিক এবং পেশাগত প্রস্তুতি বৃদ্ধি করা হয় এবং তারা সমাজের উন্নতির জন্য প্রস্তুতি করা হয়।</p>`,
		photo: "uploads/posts/s2.jpg",
		photo_alt_text: "শিক্ষা ও দক্ষতা উন্নয়ন",
		seo_title: "শিক্ষা ও দক্ষতা উন্নয়ন",
		seo_keyword: "শিক্ষা ও দক্ষতা উন্নয়ন",
		seo_description: "শিক্ষা ও দক্ষতা উন্নয়ন",
		seo_schema_tags: "শিক্ষা ও দক্ষতা উন্নয়ন",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb1','65769b274825174d9fd67baf'],
		comments:[],
		status: true,

	},
	{
		title: "স্বাস্থ্য সেবা",
		subtitle: "স্বাস্থ্য সেবা হলো মানুষের স্বাস্থ্যসম্পর্কিত যেকোনো সেবা ",
		short_description: `<p>স্বাস্থ্য সেবা হলো মানুষের স্বাস্থ্যসম্পর্কিত যেকোনো সেবা বা সুযোগ যা মানুষদের স্বাস্থ্য সম্পর্কে সাহায্য ও যত্ন প্রদান করে।</p>`,
		description: `<p>স্বাস্থ্য সেবা হলো মানুষের স্বাস্থ্যসম্পর্কিত যেকোনো সেবা বা সুযোগ যা মানুষদের স্বাস্থ্য সম্পর্কে সাহায্য ও যত্ন প্রদান করে। এটি বিভিন্ন ধরনের সেবা ও সুযোগ যেমন চিকিৎসা, প্রতিরক্ষা, প্রচার-প্রসার, প্রশিক্ষণ ইত্যাদি যা মানুষের স্বাস্থ্যকে উন্নত করতে সাহায্য করে।স্বাস্থ্য সেবা অনেক বিভিন্ন রূপে প্রদান করা হয়, যেমনঃ১. চিকিৎসা ও পরামর্শ: রোগীদের জন্য নিউনার্সিং কেয়ার, ডাক্তারি পরামর্শ, অ্যাম্বুলেন্স সেবা ইত্যাদি।
		২. প্রতিরক্ষা ও প্রচার-প্রসার: স্বাস্থ্য সচেতনতা বাড়ানো, প্রশ্নোত্তর অনুষ্ঠান, ওয়েবসাইট ও সোশ্যাল মিডিয়া প্রচারের মাধ্যমে জনগণের সাথে স্বাস্থ্য সম্পর্কিত তথ্য ভাগাভাগি করা।
		৩. শিক্ষা ও প্রশিক্ষণ: স্বাস্থ্য সচেতনতা বাড়ানো, প্রাকৃতিক সাবলীলতা, নিজের যত্ন নেওয়া ইত্যাদি শিক্ষা দেওয়া।
		৪. চিকিৎসাধীন পরিচর্যা ও রেসার্চ: সাইন্টিফিক রিসার্চ, নতুন চিকিৎসাধীন পদ্ধতি অনুসন্ধান এবং বিজ্ঞানীগণের কাজ সহায়তা করা।
		৫. কর্মস্থলীয় স্বাস্থ্য পরিচর্যা: কর্মস্থলে স্বাস্থ্য পরিচর্যা প্রদান করা যাতে কর্মীরা সুস্থ থাকেন এবং কাজের দায়িত্ব ঠিকমত পালন করতে পারেন।</p>`,
		photo: "uploads/posts/s33.jpg",
		photo_alt_text: "স্বাস্থ্য সেবা",
		seo_title: "স্বাস্থ্য সেবা",
		seo_keyword: "স্বাস্থ্য সেবা",
		seo_description: "স্বাস্থ্য সেবা",
		seo_schema_tags: "স্বাস্থ্য সেবা",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb1', '65769b274825174d9fd67bb5','65769b274825174d9fd67baf'],
		comments:[],
		status: true,

	},
	{
		title: "প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবা",
		subtitle: "প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবা হলো সেবামূলক কাজের একটি অংশ ",
		short_description: `<p>প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবা হলো সেবামূলক কাজের একটি অংশ যা অসহায়, দুর্বল, প্রতিবন্ধী।</p>`,
		description: `<p>প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবা হলো সেবামূলক কাজের একটি অংশ যা অসহায়, দুর্বল, প্রতিবন্ধী বা প্রতিষ্ঠানিক সংগঠনের জন্য প্রদান করা হয়। এই ধরনের সেবা সাধারণত অনুশাসনিক ও প্রতিষ্ঠানিক সংগঠন, সরকারী প্রতিষ্ঠান, গৈর-সরকারী সংগঠন বা স্বেচ্ছাসেবী সংগঠনের মাধ্যমে প্রদান করা হয়।এই প্রতিবন্ধী ও প্রতিষ্ঠানিক সেবাগুলির মধ্যে নিম্নলিখিত কিছু অংশ অন্তর্ভুক্ত থাকতে পারে:
		১. দুর্বল সম্প্রদায়ের জন্য সেবা: বৃদ্ধ ব্যক্তিদের, অনুপস্থিত ব্যক্তিদের, প্রতিবন্ধী ব্যক্তিদের জন্য বিভিন্ন সেবা প্রদান করা।
		২. স্বাস্থ্য ও চিকিৎসা সেবা: অসুস্থ ও অসুস্থ ব্যক্তিদের জন্য চিকিৎসা, পরামর্শ, ঔষধ ও হাসপাতালের সেবা।
		৩. শিক্ষামূলক ও প্রশিক্ষণ সেবা: শিক্ষার্থীদের জন্য স্কুল, কলেজ, টিউশন, ছাত্রদের জন্য দর্পণ, বিনামূল্যে প্রশিক্ষণ সেবা ইত্যাদি।
		৪. আদালতীয় ও আইনি সেবা: অস্বীকৃত ব্যক্তিদের জন্য বিনামূল্যে আইনি সেবা প্রদান করা, আইনী পরামর্শ দেওয়া, বিচারাধীন ব্যক্তিদের জন্য সাহায্য করা ইত্যাদি।
		৫. অন্যান্য সেবা: ভাতা ও অনুদান, কর্মসংস্থান, অনুপ্রাণিত ব্যক্তিদের জন্য পেশাগত সহায়তা, দরিদ্র ব্যক্তিদের জন্য খাদ্য ও পানীয় সরবরাহ ইত্যাদি।</p>`,
		photo: "uploads/posts/s4.jpg",
		photo_alt_text: "প্রতিবন্ধী ও প্রতিষ্ঠানিক",
		seo_title: "প্রতিবন্ধী ও প্রতিষ্ঠানিক",
		seo_keyword: "প্রতিবন্ধী ও প্রতিষ্ঠানিক",
		seo_description: "প্রতিবন্ধী ও প্রতিষ্ঠানিক",
		seo_schema_tags: "প্রতিবন্ধী ও প্রতিষ্ঠানিক",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb1'],
		comments:[],
		status: true,

	},
	{
		title: "দুর্যোগ ব্যবস্থা এবং সাহায্য",
		subtitle: " দুর্যোগ ব্যবস্থা ও সাহায্য হলো সেসব পদক্ষেপ এবং পরিকল্পনা যা কোনও প্রাকৃতিক",
		short_description: `<p>
		দুর্যোগ ব্যবস্থা ও সাহায্য হলো সেসব পদক্ষেপ এবং পরিকল্পনা যা কোনও প্রাকৃতিক বা মানুষিক দুর্যোগের সময় মানুষদের সহায়তা করার জন্য নেয়া হয়।
		</p>`,
		description: `<p>দুর্যোগ ব্যবস্থা ও সাহায্য হলো সেসব পদক্ষেপ এবং পরিকল্পনা যা কোনও প্রাকৃতিক বা মানুষিক দুর্যোগের সময় মানুষদের সহায়তা করার জন্য নেয়া হয়। এটি বিভিন্ন রকম দুর্যোগের সময় জনগণের প্রাণনাশ বা সম্পদের ক্ষতির পরিস্থিতি তৈরি হতে পারে এবং সেগুলির সাম্প্রতিক পরিস্থিতিতে প্রভাবশালী হতে পারে।দুর্যোগ ব্যবস্থায় নিম্নলিখিত কাজগুলি অন্তর্ভুক্ত থাকতে পারে:প্রতিরক্ষা পরিকল্পনা: জনগণের জন্য প্রাকৃতিক বা মানুষিক দুর্যোগের পূর্বাভাস ও প্রতিরোধে পরিকল্পনা অবদান রাখা।
		মানবিক সাহায্য ও সংস্থাগত প্রতিস্থাপন: দুর্যোগের পর মানবিক সাহায্য, খাদ্য ও পানীয় সরবরাহ, আশ্রয় ও মেডিকেল সাহায্যের ব্যবস্থা।দুর্যোগ প্রতিকার: দুর্যোগের সময় তাৎক্ষণিক প্রতিকারের ব্যবস্থা এবং কাটাকুটির সাহায্য প্রদান।প্রতিরক্ষা পর্যায়ের সংস্থাগত ব্যবস্থা: দুর্যোগ সময়ে সংস্থাগত প্রতিরক্ষা পরিকল্পনা অনুষ্ঠানের ব্যবস্থা।প্রচেষ্টা কর্মসূচি: প্রাকৃতিক দুর্যোগের পরিস্থিতিতে জনগণের মধ্যে সচেতনতা বাড়ানো এবং তাদের প্রতিরক্ষা ক্ষমতা বৃদ্ধি করা।
		দুর্যোগ প্রবন্ধনা ও তদন্ত: দুর্যোগের পর ঘটনা ও তার পরিস্থিতির তদন্ত, পর্যবেক্ষণ ও মূল্যায়ন করা।</p>`,
		photo: "uploads/posts/s5.jpg",
		photo_alt_text: "দুর্যোগ ব্যবস্থা",
		seo_title: "দুর্যোগ ব্যবস্থা",
		seo_keyword: "দুর্যোগ ব্যবস্থা",
		seo_description: "দুর্যোগ ব্যবস্থা",
		seo_schema_tags: "দুর্যোগ ব্যবস্থা",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb1','65769b274825174d9fd67baf'],
		comments:[],
		status: true,

	},
	{
		title: "পরিবেশ সংরক্ষণ",
		subtitle: " পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ",
		short_description: `<p>পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ যা মানুষের ও প্রাকৃতিক পরিবেশের সমন্বয়ে ব্যবস্থা করে।</p>`,
		description: `<p> পরিবেশ সংরক্ষণ হলো এমন একটি অত্যন্ত গুরুত্বপূর্ণ অংশ যা মানুষের ও প্রাকৃতিক পরিবেশের সমন্বয়ে ব্যবস্থা করে। এটি প্রাকৃতিক সম্পদ, জীব বৈচিত্র্য, বায়ু, জল এবং মাটির সুরক্ষা ও সংরক্ষণের জন্য বিভিন্ন ধরনের কর্মকাণ্ড এবং নৈতিক দায়িত্ব নিয়ে ব্যাপক অর্থে প্রয়োজনীয়। পরিবেশ সংরক্ষণের উদ্দেশ্য হলো সামাজিক, আর্থিক, এবং পরিবেশের সাথে সামঞ্জস্য বজায় রাখা। এটি বাস্তব জীবনে পরিবেশের সংরক্ষণে লোকেরা সচেতন হতে উৎসাহিত করে এবং সুস্থ এবং সমৃদ্ধ পরিবেশের জন্য প্রতিবদ্ধ করে।

		পরিবেশ সংরক্ষণের কার্যক্রমে যাতে বিভিন্ন সমস্যা ও উপায় আসে, তা হলো:
		
		জলবায়ু পরিবর্তন: জলবায়ু পরিবর্তন নিয়ে সচেতনতা বাড়ানো, এর প্রভাবে মানুষের জীবন ও পরিবেশের পরিবর্তন জন্মানো।
		জল ও বায়ুর সংরক্ষণ: পানি ও বায়ুর স্বাস্থ্যগত গুনগত অবস্থা বজায় রাখার জন্য কাজ করা।
		জৈববৈচিত্র্য সংরক্ষণ: প্রাকৃতিক বাস্তবতার সংরক্ষণ ও জৈব বৈচিত্র্যের দিক থেকে অবদান রাখা।
		অতিরিক্ত জনসংখ্যার সাথে সম্প্রদায়ের সংমিলন: জনসংখ্যা বৃদ্ধি নিয়ে সচেতনতা বাড়ানো এবং সম্প্রদায়ের মধ্যে সামঞ্জস্য বজায় রাখা।
		প্রাকৃতিক দুর্যোগ নিরাপত্তা: প্রাকৃতিক দুর্যোগের প্রাকৃতিক প্রতিরক্ষা উন্নয়ন করা।
		প্রকৃতির সংরক্ষণে সম্প্রদায়ের ভূমিকা: প্রাকৃতিক সম্পদ ও সংরক্ষণের জন্য সম্প্রদায়ের অবদান বাড়ানো।
		প্রযুক্তি ব্যবহার: প্রযুক্তি ব্যবহার করে পরিবেশের সংরক্ষণে সাহায্য করা।
		শিক্ষা ও সচেতনতা: সামাজিক কর্ম</p>`,
		photo: "uploads/posts/s6.jpg",
		photo_alt_text: "পরিবেশ সংরক্ষণ",
		seo_title: "পরিবেশ সংরক্ষণ",
		seo_keyword: "পরিবেশ সংরক্ষণ",
		seo_description: "পরিবেশ সংরক্ষণ",
		seo_schema_tags: "পরিবেশ সংরক্ষণ",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb1', '65769b274825174d9fd67bb5'],
		comments:[],
		status: true,

	},

	// ইতিহাস

	{
		title: "বাংলাদেশের স্বাধীনতা সংগ্রাম",
		subtitle: "বাংলাদেশের স্বাধীনতা সংগ্রাম বাংলাদেশের ইতিহাসের একটি গর্বময় অংশ যা ১৯৭১ সালে ঘটে।",
		short_description: `<p>বাংলাদেশের স্বাধীনতা সংগ্রাম বাংলাদেশের ইতিহাসের একটি গর্বময় অংশ যা ১৯৭১ সালে ঘটে।</p>`,
		description: `<p>বাংলাদেশের স্বাধীনতা সংগ্রাম বাংলাদেশের ইতিহাসের একটি গর্বময় অংশ যা ১৯৭১ সালে ঘটে। এটি একটি ঐতিহাসিক দলিল যা দেশটির মানুষের জনগণের স্বাধীনতা ও স্বাধীন বাংলাদেশের জন্য সংগ্র

		স্বাধীনতা সংগ্রামের প্রধান ঘটনা হিসাবে ১৯৭১ সালের ২৬ মার্চ থেকে ১৬ ডিসেম্বর পর্যন্ত চলে। এই সময়কালে বাংলাদেশের মানুষের বিরোধী শক্তিগুলির বিরুদ্ধে একটি মুক্তিযুদ্ধ চলার জন্য সামর্থ্য প্রদান করা হয়েছিল। মুক্তিযুদ্ধের শুরুতেই বাংলাদেশের মানুষের মুক্তির জন্য সংগ্রামে যুক্ত হয়। এই যুদ্ধে বাংলাদেশের মানুষ বিভিন্ন প্রকার সংগ্রাম পরিপ্রেক্ষিতে একত্রিত হয়ে স্বাধীনতা ও মুক্তির লক্ষ্যে লড়াই করে।
		
		মুক্তিযুদ্ধের সময়ে বাংলাদেশের মানুষের বিরুদ্ধে বিরোধী শক্তিগুলির হত্যার অভিযোগ হয়েছিল, যেখানে পাকিস্তানি সেনাবাহিনী নিরাপদের বিরুদ্ধে সংগ্রামযুদ্ধ চালিয়েছিল। মুক্তিযুদ্ধে অনেকে অপহরণ, হত্যা, জনসংখ্যার নিখোঁজ শিকার, ও বাংলাদেশের মানুষের বিরুদ্ধে অত্যাচারের শিকার হয়েছিল।</p>`,
		photo: "uploads/posts/h1.jpg",
		photo_alt_text: "বাংলাদেশের স্বাধীনতা",
		seo_title: "বাংলাদেশের স্বাধীনতা",
		seo_keyword: "বাংলাদেশের স্বাধীনতা",
		seo_description: "বাংলাদেশের স্বাধীনতা",
		seo_schema_tags: "বাংলাদেশের স্বাধীনতা",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bab','65769b274825174d9fd67baf'],
		comments:[],
		status: true,
	},
	{
		title: "ভাষা আন্দোলন ও শহীদ দিবস",
		subtitle: " ভাষা আন্দোলন ও শহীদ দিবস বাংলাদেশের ইতিহাসের একটি অপরিসীম অংশ।",
		short_description: `<p>ভাষা আন্দোলন ও শহীদ দিবস বাংলাদেশের ইতিহাসের একটি অপরিসীম অংশ।</p>`,
		description: `<p>ভাষা আন্দোলন ও শহীদ দিবস বাংলাদেশের ইতিহাসের একটি অপরিসীম অংশ। এটি বাংলাদেশের মানুষের ভাষা ও সাংস্কৃতিক স্বাধীনতা প্রতিরোধের প্রতীক।

		১৯৫২ সালের ২১শে ফেব্রুয়ারি, ঢাকা বিশ্ববিদ্যালয়ের ছাত্র সম্প্রদায়ের একটি মেটিং অনুষ্ঠান করা হয়। এই মিটিং সময়ে তারা বাংলা ভাষা আদালতের প্রতি প্রতিষ্ঠান করতে এবং তাদের ভাষা বাংলা কে রাষ্ট্রীয় ভাষা হিসাবে গ্রহণ করার দাবি করে। কিছুদিন পর এই আন্দোলন উদ্বোধন হয়। শিক্ষার্থীদের মাঝে এই আন্দোলনের সাথে যোগ দিয়েছিলেন বাংলা ভাষার প্রেমিক সমূহ, সাহিত্যিক ও সাংস্কৃতিক ব্যক্তিত্বরা। এই আন্দোলনের পরিণামে ২১শে ফেব্রুয়ারি বাংলা ভাষা আন্দোলনের শহীদ দিবস হিসাবে স্মরণীয় হয়েছে।
		
		এই দিনটি বাংলাদেশে সকলের জন্য গৌরব দিবস হিসাবে পালিত হয়। এই দিনে মানুষেরা ভাষা আন্দোলনে বিদায় দিয়ে তাদের প্রতি শ্রদ্ধা ও সম্মান প্রদান করে। সাধারণভাবে, দেশের সমস্ত স্কুল, কলেজ, বিশ্ববিদ্যালয়, সরকারী এবং বেসরকারি প্রতিষ্ঠানে এই দিনটি শহীদ দিবস হিসাবে উদযাপন করা হয়। ভাষা আন্দোলনের শহীদদের মাঝে মানুষের প্রতি শ্রদ্ধা এবং ভাষার মূল্যায়ন জানানো হয়।</p>`,
		photo: "uploads/posts/h2.jpg",
		photo_alt_text: "ভাষা আন্দোলন",
		seo_title: "ভাষা আন্দোলন",
		seo_keyword: "ভাষা আন্দোলন",
		seo_description: "ভাষা আন্দোলন",
		seo_schema_tags: "ভাষা আন্দোলন",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bab', '65769b274825174d9fd67bb5'],
		comments:[],
		status: true,
	},
	{
		title: "বাংলাদেশের সংবিধান",
		subtitle: "বাংলাদেশের সংবিধান দেশের রাজনৈতিক ও সামাজিক নির্দেশনা নির্ধারণ করার জন্য গঠিত একটি মৌলিক ডকুমেন্ট।",
		short_description: `<p>
		বাংলাদেশের সংবিধান দেশের রাজনৈতিক ও সামাজিক নির্দেশনা নির্ধারণ করার জন্য গঠিত একটি মৌলিক ডকুমেন্ট।</p>`,
		description: `<p>বাংলাদেশের সংবিধান দেশের রাজনৈতিক ও সামাজিক নির্দেশনা নির্ধারণ করার জন্য গঠিত একটি মৌলিক ডকুমেন্ট। এটি বাংলাদেশের সরকারি প্রণালী, আইন এবং নাগরিক অধিকারের মানদন্ড নির্ধারণ করে।

		বাংলাদেশের সংবিধান তার নির্মাণের প্রাথমিক উদ্দেশ্য বাংলাদেশের রাষ্ট্রস্তরের সামাজিক ও রাজনৈতিক প্রণালীতে নির্দিষ্ট নীতি ও পদক্ষেপ নির্ধারণ করা। এটি দেশের নাগরিকদের অধিকার এবং দায়িত্ব সংশ্লিষ্ট করে এবং শাসন ব্যবস্থা পরিচালনা করা হয়।
		
		বাংলাদেশের সংবিধান বিভিন্ন অনুচ্ছেদে বিভিন্ন বিষয়ে তার নির্দেশনা দেয়, যেমন রাষ্ট্রের প্রতি দায়বদ্ধতা, সরকার ও পররাষ্ট্র প্রণালী, নাগরিক অধিকার, আইন ও বিচার পদ্ধতি, রাষ্ট্রের স্বতন্ত্রতা এবং ইত্যাদি। সংবিধানে বাংলাদেশের রাষ্ট্রীয় ছবি ও মৌলিক মানবাধিকার সম্পর্কে প্রধান দিক নির্ধারণ করা হয়েছে।
		
		সংবিধান উচ্চতর আইন হিসাবে গণ্য হয় এবং সংশোধনী প্রক্রিয়া সংশ্লিষ্ট অনুচ্ছেদের মাধ্যমে করা হয়। সংবিধান পরিবর্তন এবং সংশোধনী প্রক্রিয়া বিশেষভাবে নির্ধারণ করা হয়েছে। এটি দেশের রাজনৈতিক এবং আইন নির্ধারণ করে এবং মানুষের অধিকার ও দায়িত্ব নিয়ে গুরুত্ব দেয়।</p>`,
		photo: "uploads/posts/h3.jpg",
		photo_alt_text: "বাংলাদেশের সংবিধান",
		seo_title: "বাংলাদেশের সংবিধান",
		seo_keyword: "বাংলাদেশের সংবিধান",
		seo_description: "বাংলাদেশের সংবিধান",
		seo_schema_tags: "বাংলাদেশের সংবিধান",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bab'],
		comments:[],
		status: true,
	},
	{
		title: "গণহত্যা দিবস",
		subtitle: "গণহত্যা দিবস বাংলাদেশের ইতিহাসে একটি দুঃখজনক দিন যেখানে দেশের মানুষের স্মৃতির সম্মানে শ্রদ্ধাঞ্জলি",
		short_description: `<p>১৫ আগস্ট ১৯৭৫ সালে এই দিনটি বাংলাদেশের রাষ্ট্রপ্রধান শেখ মুজিবুর রহমান এবং তার পরিবারের অত্যন্ত ব্যক্তিগত দুর্নীতির ফলে।</p>`,
		description: `<p>বাংলাদেশের ইতিহাসে একটি দুঃখজনক দিন যেখানে দেশের মানুষের স্মৃতির সম্মানে শ্রদ্ধাঞ্জলি জ

		১৫ আগস্ট ১৯৭৫ সালে এই দিনটি বাংলাদেশের রাষ্ট্রপ্রধান শেখ মুজিবুর রহমান এবং তার পরিবারের অত্যন্ত ব্যক্তিগত দুর্নীতির ফলে বাংলাদেশের অত্যাচার, হত্যা ও অত্যাচারের পরিবর্তে হত্যার পরের একটি দিন। এই দিনটি শেখ মুজিবুর রহমানের সাথে তার পরিবার সহ সহকর্মীদের মৃত্যুর স্মৃতির জন্য প্রতি বছর মানানো হয়।
		
		এই দিনটি বাংলাদেশের মানুষের মধ্যে মুক্তিযুদ্ধের শহীদদের ও স্বাধীনতা সংগ্রামের অন্তর্নিহিত বুদ্ধিমত্তা, সাহস ও জ্ঞানের মাধ্যমে জাগ্রত করে। এই দিনে মানুষের মধ্যে একটি সামাজিক উদ্বেগ ও প্রতিরোধের জন্য আহ্বান ঘোষণা করা হয়। এটি বাংলাদেশের রাষ্ট্রীয় স্মৃতি এবং শ্রদ্ধাঞ্জলির সম্মানে প্রতিবাদ ও বিমর্শের চিহ্ন হিসাবে পরিচিত।</p>`,
		photo: "uploads/posts/h4.jpg",
		photo_alt_text: "গণহত্যা দিবস",
		seo_title: "গণহত্যা দিবস",
		seo_keyword: "গণহত্যা দিবস",
		seo_description: "গণহত্যা দিবস",
		seo_schema_tags: "গণহত্যা দিবস",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bab', '65769b274825174d9fd67bb5','65769b274825174d9fd67baf'],
		comments:[],
		status: true,
	},
	{
		title: "সাংস্কৃতিক ও ঐতিহাসিক ঐতিহ্য ",
		subtitle: "সাংস্কৃতিক ও ঐতিহাসিক ঐতিহ্য বাংলাদেশের ঐতিহাসিক ও সাংস্কৃতিক সমৃদ্ধিতের উপর ভিত্তি রয়েছে। ",
		short_description: `<p>সাংস্কৃতিক ও ঐতিহাসিক ঐতিহ্য বাংলাদেশের ঐতিহাসিক ও সাংস্কৃতিক সমৃদ্ধিতের উপর ভিত্তি রয়েছে।।</p>`,
		description: `<p>সাংস্কৃতিক ও ঐতিহাসিক ঐতিহ্য বাংলাদেশের ঐতিহাসিক ও সাংস্কৃতিক সমৃদ্ধিতের উপর ভিত্তি রয়েছে। এটি দেশের অনুষ্ঠানগুলি, ঐতিহাসিক নৃত্য, সাংস্কৃতিক বিশেষত্ব, স্মৃতিচিহ্ন এবং বিভিন্ন উৎসবের জন্য গর্বের উৎস।

		বাংলাদেশের সাংস্কৃতিক ও ঐতিহাসিক ঐতিহ্য প্রাচীন যুগে শুরু হয়েছিল, যা নৃত্য, সঙ্গীত, শিল্পকলা, শিক্ষা, বিজ্ঞান এবং ধর্মীয় ব্যবস্থা সহ বিভিন্ন সংস্কৃতি এবং অনুষ্ঠানের মাধ্যমে অত্যন্ত সমৃদ্ধ ছিল।
		
		বাংলাদেশের সাংস্কৃতিক ও ঐতিহাসিক ঐতিহ্যের মধ্যে বিভিন্ন ধর্মীয় উৎসব, বৌদ্ধ, হিন্দু, ইসলামী সংস্কৃতি, বিভিন্ন বিশেষজ্ঞ কার্যক্রম, প্রদর্শনী, বিভিন্ন শিক্ষা সংস্থা, বিভিন্ন পালিত ও বর্তমান সংস্কৃতির মধ্যে ব্যাপক পরিস্থিতি রয়েছে।
		
		বাংলাদেশের সাংস্কৃতিক ও ঐতিহাসিক ঐতিহ্য দেশের অনুষ্ঠানের বিশেষ গর্বের সৃষ্টিকারী এবং এটি দেশের মানুষের ভবিষ্যতের প্রতি প্রশাসন এবং আদর্শ প্রকাশ করে।</p>`,
		photo: "uploads/posts/h5.jpg",
		photo_alt_text: "সাংস্কৃতিক ও ঐতিহাসিক",
		seo_title: "সাংস্কৃতিক ও ঐতিহাসিক",
		seo_keyword: "সাংস্কৃতিক ও ঐতিহাসিক",
		seo_description: "সাংস্কৃতিক ও ঐতিহাসিক",
		seo_schema_tags: "সাংস্কৃতিক ও ঐতিহাসিক",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bab'],
		comments:[],
		status: true,
	},
	{
		title: "বাংলাদেশের অর্থনৈতিক উন্নয়ন",
		subtitle: "বাংলাদেশের অর্থনৈতিক উন্নয়ন একটি গুরুত্বপূর্ণ বিষয় যা দেশের অর্থনৈতিক সামর্থ্য এবং প্রস্তুতির প্রক্রিয়ার মাধ্যমে অর্থনৈতিক স্থিতির উন্নতি ও উন্নয়নে ব্যাপক অবদান রেখেছে।",
		short_description: `<p>বাংলাদেশের অর্থনৈতিক উন্নয়ন প্রস্তুতি ও উন্নয়নের জন্য অনেক কাজ করা হয়েছে, যেমন প্রতিষ্ঠান, ব্যবসায়িক প্রণালী।</p>`,
		description: `<p>বাংলাদেশের অর্থনৈতিক উন্নয়ন একটি গুরুত্বপূর্ণ বিষয় যা দেশের অর্থনৈতিক সামর্থ্য এবং প্রস্তুতির প্রক্রিয়ার মাধ্যমে অর্থনৈতিক স্থিতির উন্নতি ও উন্নয়নে ব্যাপক অবদান রেখেছে। এটি দেশের অর্থনৈতিক প্রস্তুতি, বৃদ্ধি ও সমৃদ্ধির পথে প্রধান ভূমিকা পালন করে।

		বাংলাদেশের অর্থনৈতিক উন্নয়ন প্রস্তুতি ও উন্নয়নের জন্য অনেক কাজ করা হয়েছে, যেমন প্রতিষ্ঠান, ব্যবসায়িক প্রণালী, বাজারের সাথে সংস্কৃতি ও বাণিজ্যিক সংস্থান প্রতিষ্ঠান। বাংলাদেশের অর্থনৈতিক উন্নয়নে সরকার অত্যন্ত গুরুত্বপূর্ণ ভূমিকা রাখে এবং প্রাথমিক ভাবে বিভিন্ন অর্থনৈতিক নীতি গঠন করে যা অর্থনৈতিক উন্নয়নে অগ্রগতির জন্য গুরুত্বপূর্ণ।
		
		বাংলাদেশের অর্থনৈতিক উন্নয়নের মধ্যে বাণিজ্য, পরিবহন, শিক্ষা, স্বাস্থ্যসেবা, প্রযুক্তি, শিল্প ও প্রযুক্তি এবং পরিবেশের উন্নয়নের ক্ষেত্রে অনেক কাজ হয়েছে। এই উন্নয়নের মাধ্যমে দেশটি অর্থনৈতিক দিক থেকে উন্নতি করেছে এবং মানুষের জীবনযাপনের মান বাড়াচ্ছে।</p>`,
		photo: "uploads/posts/rn4.png",
		photo_alt_text: "অর্থনৈতিক উন্নয়ন",
		seo_title: "অর্থনৈতিক উন্নয়ন",
		seo_keyword: "অর্থনৈতিক উন্নয়ন",
		seo_description: "অর্থনৈতিক উন্নয়ন",
		seo_schema_tags: "অর্থনৈতিক উন্নয়ন",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bab'],
		comments:[],
		status: true,
	},

	// রাজনিতি

	{
		title: "গণতান্ত্রিক পদ্ধতি",
		subtitle: "গণতান্ত্রিক পদ্ধতি হলো এমন একটি রাজনীতি ও শাসনের পদ্ধতি যেখানে শক্তি এবং কার্যকর সরকার মানুষের প্রতি ভারসাম্যবাদী উপায়ে নির্বাচিত হয়।",
		short_description: `<p>গণতান্ত্রিক পদ্ধতি হলো এমন একটি রাজনীতি ও শাসনের পদ্ধতি যেখানে শক্তি এবং কার্যকর সরকার মানুষের প্রতি ভারসাম্যবাদী উপায়ে নির্বাচিত হয়।</p>`,
		description: `<p>
		গণতান্ত্রিক পদ্ধতি হলো এমন একটি রাজনীতি ও শাসনের পদ্ধতি যেখানে শক্তি এবং কার্যকর সরকার মানুষের প্রতি ভারসাম্যবাদী উপায়ে নির্বাচিত হয়। এই পদ্ধতিতে নাগরিকদের অধিকার এবং মতামতের মূল্যায়ন করা হয়। গণতান্ত্রিক পদ্ধতি একটি ডেমোক্রেটিক সিস্টেম যেখানে মানুষের মতামত ও ইচ্ছাশক্তি মূলনীতি হিসেবে গণমতান্ত্রিক প্রক্রিয়ার মাধ্যমে নির্বাচিত নেতা এবং শাসকদের প্রতি নিয়ন্ত্রণ প্রদান করে।
		
		গণতান্ত্রিক পদ্ধতির মূল উদ্দেশ্য হলো শাসনের যে কোনও ধরণের সর্বাধিক সামান্য সরকারী প্রক্রিয়া এবং রাজনৈতিক নিয়ন্ত্রণ দেওয়ার জন্য নাগরিকদের সাথে সরাসরি যোগাযোগ সম্পর্কে সৃষ্টি করা। এটি নাগরিকদের পক্ষ থেকে শাসন সম্পর্কে দৃষ্টিকোণ বৃদ্ধি করে এবং সরকার কর্তৃক নেতাদের সম্মানিত ভূমিকা প্রদান করে। গণতান্ত্রিক পদ্ধতিতে প্রতি নাগরিককে মুক্তি এবং সমান অধিকার অর্জনের অধিকার দেওয়া হয়।
		
		গণতান্ত্রিক পদ্ধতিতে নাগরিকদের মতামত বিশেষ গুরুত্ব দেওয়া হয়, এবং রাষ্ট্র এবং সরকারের কার্যাদেশ এবং নীতির গঠনে তাদের অংশগ্রহণ প্রয়োজন। এটি নাগরিকদের জনগণের মতামত প্রকাশ করার এবং তাদের পক্ষ থেকে নেতারা এবং সরকারের প্রতি জবাবদিহিতা দাবি করার মাধ্যমে ডেমোক্রেটিক সিস্টেম সাধারণ করে। এর মাধ্যমে নাগরিকেরা নিজেদের মতামত প্রকাশ করতে, নির্বাচনে অংশগ্রহণ করতে এবং সরকারের প্রতি নির্দিষ্ট আদালতি এবং নীতিমালার সাথে আপাতত হতাশা দেখাতে সক্ষম হতে পারে।</p>`,
		photo: "uploads/posts/rn1.jpg",
		photo_alt_text: "গণতান্ত্রিক পদ্ধতি",
		seo_title: "গণতান্ত্রিক পদ্ধতি",
		seo_keyword: "গণতান্ত্রিক পদ্ধতি",
		seo_description: "গণতান্ত্রিক পদ্ধতি",
		seo_schema_tags: "গণতান্ত্রিক পদ্ধতি",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba9', '65769b274825174d9fd67bb5'],
		comments:[],
		status: true,
	},
	{
		title: "রাজনৈতিক ইতিহাস",
		subtitle: "রাজনৈতিক ইতিহাস হলো একটি ঐতিহাসিক অধ্যয়ন যা রাজনৈতিক ঘটনার বিকাশ",
		short_description: `<p>রাজনৈতিক ইতিহাস হলো একটি ঐতিহাসিক অধ্যয়ন যা রাজনৈতিক ঘটনার বিকাশ, নেতা এবং সরকারের সৃষ্টি।</p>`,
		description: `<p>রাজনৈতিক ইতিহাস হলো একটি ঐতিহাসিক অধ্যয়ন যা রাজনৈতিক ঘটনার বিকাশ, নেতা এবং সরকারের সৃষ্টি, বিভিন্ন রাজনৈতিক প্রতিষ্ঠানের গঠন এবং পরিবর্তন, রাষ্ট্রীয় ও আন্তর্জাতিক রাজনৈতিক ঘটনার নেতাদের ভূমিকা ইত্যাদি নিয়ে বিস্তারিত অধ্যয়ন করে। এটি একটি রাষ্ট্র বা একটি সমাজের রাজনৈতিক বিকাশের ইতিহাসকে তুলে ধরে যা তার অতীতে ঘটেছে এবং তার সম্প্রদায়ের সাথে সংস্কৃতি গঠনে ভূমিকা পালন করে।

		রাজনৈতিক ইতিহাসের মাধ্যমে আমরা এক দেশের শাসন, নীতি ও সরকারের বিকাশের অধিকারী প্রক্রিয়া, ক্রম এবং পরিবর্তন জানতে পারি। এটি সাধারণত একটি নির্দিষ্ট সময়কালে অনুষ্ঠিত হয়, যেটি একটি রাষ্ট্র বা অঞ্চলের জনগণের নির্দিষ্ট সাংস্কৃতিক, সামাজিক, আর্থিক এবং রাজনৈতিক দৃষ্টিভঙ্গি সম্পর্কে সাক্ষাত্কার করে।
		
		একটি দেশের রাজনৈতিক ইতিহাস তার উন্নতি, সংকট, সামরিক ও রাজনৈতিক ক্ষমতা, নীতি এবং নেতাদের ভূমিকা সম্পর্কে সম্পূর্ণ ধারণা দেয়।</p>`,
		photo: "uploads/posts/rn2.jpg",
		photo_alt_text: "রাজনৈতিক ইতিহাস",
		seo_title: "রাজনৈতিক ইতিহাস",
		seo_keyword: "রাজনৈতিক ইতিহাস",
		seo_description: "রাজনৈতিক ইতিহাস",
		seo_schema_tags: "রাজনৈতিক ইতিহাস",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba9'],
		comments:[],
		status: true,
	},
	{
		title: "নির্বাচন",
		subtitle: "নির্বাচন একটি মাধ্যম যা মানুষের জন্য অন্যত্র অধিকার অর্জনের সুযোগ প্রদান করে।",
		short_description: `<p>নির্বাচন একটি মাধ্যম যা মানুষের জন্য অন্যত্র অধিকার অর্জনের সুযোগ প্রদান করে। এটি একটি ডেমোক্রেটিক পদ্ধতির।</p>`,
		description: `<p>নির্বাচন একটি মাধ্যম যা মানুষের জন্য অন্যত্র অধিকার অর্জনের সুযোগ প্রদান করে। এটি একটি ডেমোক্রেটিক পদ্ধতির মাধ্যমে প্রতি নাগরিকের মতামত প্রকাশ করার সুযোগ দেয়, যাতে সরকার এবং নেতাদের নির্বাচিত প্রতিষ্ঠান এবং নেতৃত্ব প্রাপ্ত করা যায়।

		নির্বাচনে মানুষেরা তাদের নির্দিষ্ট পছন্দ অনুসারে নেতাদের প্রতি ভোট দেয়। এটি সাধারণত নির্দিষ্ট সময়কালে অনুষ্ঠিত হয়, যা একটি রাষ্ট্র বা অঞ্চলের জনগণ প্রতিনিধিত্ব করে।
		
		নির্বাচনে মানুষেরা ভোট দেয় যাতে তারা তাদের পছন্দ অনুসারে নেতা, দল, বা নীতিমালা বা কোনও নির্দিষ্ট বিষয়ে প্রতিষ্ঠানে সাপোর্ট করতে পারে। এটি একটি গুরুত্বপূর্ণ উপায় যাতে জনগণের মতামত প্রকাশ করা হয় এবং নির্বাচিত প্রতিনিধিদের মাধ্যমে সরকারী নীতিতে পরিবর্তন ঘটানো যায়।
		
		নির্বাচনে সাধারণত নির্দিষ্ট নির্দেশিকা অনুসরণ করে, যা নির্বাচন কমিশন বা অন্যান্য প্রতিষ্ঠানের দ্বারা নির্ধারিত হতে পারে। এই নির্দেশিকা মানুষের ভোট গ্রহণের উপর নির্ভর করে, যাতে নির্বাচন সঠিক, বিশ্বস্ত এবং প্রতিষ্ঠিত হতে পারে।</p>`,
		photo: "uploads/posts/rn3.jpg",
		photo_alt_text: "নির্বাচন",
		seo_title: "নির্বাচন",
		seo_keyword: "নির্বাচন",
		seo_description: "নির্বাচন",
		seo_schema_tags: "নির্বাচন",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba9'],
		comments:[],
		status: true,
	},
	{
		title: "বাংলাদেশের অর্থনৈতিক উন্নয়ন",
		subtitle: "বাংলাদেশের অর্থনৈতিক উন্নয়ন দেশের অর্থনীতির সুষ্ঠু, দ্রুত এবং সামর্থ্যবান বিকাশের উপর ভিত্তি করে। ",
		short_description: `<p>বাংলাদেশের অর্থনৈতিক উন্নয়ন দেশের অর্থনীতির সুষ্ঠু, দ্রুত এবং সামর্থ্যবান বিকাশের উপর ভিত্তি করে। ।</p>`,
		description: `<p>বাংলাদেশের অর্থনৈতিক উন্নয়ন দেশের অর্থনীতির সুষ্ঠু, দ্রুত এবং সামর্থ্যবান বিকাশের উপর ভিত্তি করে। এটি দেশের অর্থনৈতিক সম্প্রদায়ের উন্নয়ন, ব্যবসায়িক প্রস্তুতি, মানব সম্পদের বৃদ্ধি এবং জনগণের ভাল সম্মান নিশ্চিত করে।

		বাংলাদেশের অর্থনৈতিক উন্নয়নে বিভিন্ন কারণ রয়েছে, যেমন উদ্যোগ, ব্যবসায়িক প্রস্তুতি, বিদেশি মুদ্রা প্রবাহ, বিভিন্ন সেক্টরে বিনিয়োগ, প্রযুক্তি ব্যবহার এবং সরকারের নীতিমালা।
		
		বিশেষত, কৃষি, গাড়ি নির্মাণ, টেক্সটাইল ও পোশাক উৎপাদন, কৃষি উদ্যোগ, জাতীয় ব্যাংক এবং বিদেশি মুদ্রা প্রবাহ এমন কিছু ক্ষেত্র যা বাংলাদেশের অর্থনৈতিক উন্নয়নে গুরুত্বপূর্ণ ভূমিকা রাখে।
		
		সরকারের নীতিমালা, ব্যবসায়িক প্রস্তুতি, শিক্ষার সুযোগ বৃদ্ধি এবং প্রযুক্তির ব্যবহার দেশের অর্থনৈতিক উন্নয়নে গুরুত্বপূর্ণ অংশ রাখে। বাংলাদেশ সম্প্রতি বিভিন্ন উন্নয়নে উল্লেখযোগ্য প্রগতি করেছে, তবে অপেক্ষায় রয়েছে কিছু সমস্যা যেমন দারিদ্র্য, করুণাময় সমাজ, পরিবেশের সমস্যা, বিশেষত সংস্কৃতি ও তার সংরক্ষণ।</p>`,
		photo: "uploads/posts/rn4.png",
		photo_alt_text: "অর্থনৈতিক",
		seo_title: "অর্থনৈতিক",
		seo_keyword: "অর্থনৈতিক",
		seo_description: "অর্থনৈতিক",
		seo_schema_tags: "অর্থনৈতিক",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba9'],
		comments:[],
		status: true,
	},
	{
		title: "আন্তর্জাতিক সম্পর্ক",
		subtitle: "বাংলাদেশের আন্তর্জাতিক সম্পর্ক দেশের অন্যতম গুরুত্বপূর্ণ বিষয়।",
		short_description: `<p>বাংলাদেশের আন্তর্জাতিক সম্পর্ক দেশের অন্যতম গুরুত্বপূর্ণ বিষয়। এটি দেশের বাহ্যিক প্রতিরক্ষা, অর্থনৈতিক উন্নয়ন, বৈশ্বিক ।</p>`,
		description: `<p>বাংলাদেশের আন্তর্জাতিক সম্পর্ক দেশের অন্যতম গুরুত্বপূর্ণ বিষয়। এটি দেশের বাহ্যিক প্রতিরক্ষা, অর্থনৈতিক উন্নয়ন, বৈশ্বিক সামরিক সহযোগিতা, বিজ্ঞান ও প্রযুক্তি বিনিময়, সাংস্কৃতিক আদান-প্রদান ইত্যাদির সম্পর্কে কাজ করে।

		বাংলাদেশ বিশ্বের বিভিন্ন দেশ সহ আন্তর্জাতিক সম্পর্ক রাখে এবং বিভিন্ন আন্তর্জাতিক প্রতিষ্ঠানে সদস্য। দেশটি একটি বৈশ্বিক স্তরের সহযোগিতার অংশীদার এবং সম্প্রদায়িক প্রতিষ্ঠানের সদস্য হিসেবে অংশগ্রহণ করে।
		
		বাংলাদেশের বাহ্যিক সম্পর্ক যাতে একটি গুরুত্বপূর্ণ অংশ খেলে তা হলো আন্তর্জাতিক বাণিজ্যিক সম্পর্ক। এটি দেশের অর্থনৈতিক উন্নয়নে একটি মৌলিক ভূমিকা পালন করে। বাংলাদেশ বিশ্ব বাজারে তার প্রধান পণ্য রপ্তানি করে এবং বিভিন্ন দেশ থেকে আয়াত করে।
		
		দেশের আন্তর্জাতিক সম্পর্কের মাধ্যমে বাংলাদেশ বিভিন্ন আন্তর্জাতিক সম্মেলন, সভা, বৈঠক, এবং আন্তর্জাতিক প্রতিষ্ঠানের মাধ্যমে বিভিন্ন সহযোগিতা স্থাপন করে থাকে।
		
		বাংলাদেশের আন্তর্জাতিক সম্পর্ক নতুন বিজ্ঞান, প্রযুক্তি এবং পরিবেশের উন্নয়নে অনেকটা গুরুত্বপূর্ণ ভূমিকা পালন করে। এটি দেশের অর্থনৈতিক ও সামাজিক উন্নয়নে অগ্রগতির পথে একটি গুরুত্বপূর্ণ অংশ রাখে।</p>`,
		photo: "uploads/posts/rn5.jpg",
		photo_alt_text: "আন্তর্জাতিক সম্পর্ক",
		seo_title: "আন্তর্জাতিক সম্পর্ক",
		seo_keyword: "আন্তর্জাতিক সম্পর্ক",
		seo_description: "আন্তর্জাতিক সম্পর্ক",
		seo_schema_tags: "আন্তর্জাতিক সম্পর্ক",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba9'],
		comments:[],
		status: true,
	},
	{
		title: "নারী রাজনীতি",
		subtitle: "নারী রাজনীতি বা Women in Politics বাংলাদেশে একটি গুরুত্বপূর্ণ এবং দৃষ্টিশক্তির বিষয়।",
		short_description: `<p>নারী রাজনীতি বা Women in Politics বাংলাদেশে একটি গুরুত্বপূর্ণ এবং দৃষ্টিশক্তির বিষয়। নারীদের রাজনৈতিক অংশগ্রহণ এবং সামাজিক পরিবর্তনে তাদের ভূমিকা অত্যন্ত গুরুত্বপূর্ণ।</p>`,
		description: `<p>নারী রাজনীতি বা Women in Politics বাংলাদেশে একটি গুরুত্বপূর্ণ এবং দৃষ্টিশক্তির বিষয়। নারীদের রাজনৈতিক অংশগ্রহণ এবং সামাজিক পরিবর্তনে তাদের ভূমিকা অত্যন্ত গুরুত্বপূর্ণ। মহিলারা রাজনৈতিক দলে অংশগ্রহণ করে, সরকার পদে বা সাংসদ হিসেবে সেবা করে এবং নেতৃত্ব দিয়ে রাষ্ট্রীয় ও আন্তর্জাতিক পরিস্থিতিতে পরিবর্তন ঘটাতে যোগ দিতে প্রবৃত্তি দেখাচ্ছেন।

		বাংলাদেশে মহিলারা প্রধানমন্ত্রী ও রাষ্ট্রপতি হিসেবে প্রমিনেন্ট অংশগ্রহণ করেছেন। শেখ হাসিনা বাংলাদেশের প্রথম মহিলা প্রধানমন্ত্রী এবং কাল্পনিক ভূমিকায় অনেক বিশ্বাসী তারা। মহিলার অধিকার এবং সমানতা সংক্রান্ত আইন ও নীতির প্রয়োগ বাড়ানো হয়েছে, যা রাজনৈতিক পদস্থানে তাদের অংশগ্রহণ বাড়াতে সাহায্য করে।
		
		মহিলার রাজনৈতিক অংশগ্রহণ বাড়ানোর জন্য নারী শিক্ষা, স্বাস্থ্য সেবা, বাসায় সর্বাধিক সংরক্ষিত ও সমর্থনযোগ্য পরিবেশ প্রয়োজন। এছাড়াও, সামাজিক উন্নয়নে তাদের অংশগ্রহণ এবং কর্মসূচিতে তাদের ভূমিকা মর্যাদা দেওয়া দরকার।</p>`,
		photo: "uploads/posts/rn6.jpg",
		photo_alt_text: "নারী রাজনীতি",
		seo_title: "নারী রাজনীতি",
		seo_keyword: "নারী রাজনীতি",
		seo_description: "নারী রাজনীতি",
		seo_schema_tags: "নারী রাজনীতি",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba9'],
		comments:[],
		status: true,
	},

	// বাংলাদেশ
	{
		title: "আমার বাংলাদেশ",
		subtitle: "বাংলাদেশের ঐতিহাসিক, সাংস্কৃতিক ও প্রাকৃতিক সৌন্দর্য নিয়ে আলোচনা।",
		short_description: `<p>বাংলাদেশ, যা প্রাকৃতিক সৌন্দর্যে প্রচুর, তার সমৃদ্ধ ঐতিহাসিক প্রচুর সম্পদে প্রতিফলিত, সুন্দর নদী, খুবই সহজে মানুষের হাসি ও মানুষের অত্যাচার ও স্বাধীনতা প্রিয় দেশ।</p>`,
		description: `<p>"আমার বাংলাদেশ" হলো একটি অদ্ভুত দেশের সম্পর্কে মনোভাবনামূলক বর্ণনা। এটি যে বাংলাদেশ নিয়ে আমাদের প্রেম এবং জানা অভিজ্ঞতা অনুকরণ করে তা নির্দেশ করে।

		বাংলাদেশ, যা প্রাকৃতিক সৌন্দর্যে প্রচুর, তার সমৃদ্ধ ঐতিহাসিক প্রচুর সম্পদে প্রতিফলিত, সুন্দর নদী, খুবই সহজে মানুষের হাসি ও মানুষের অত্যাচার ও স্বাধীনতা প্রিয় দেশ। এটি একটি ভৌগোলিক ভিন্নতা এবং সাংস্কৃতিক বৈচিত্র্যময় দেশ, যেখানে মানুষের আত্মতৃপ্তি বহুতে বেশি গুরুত্ব প্রাপ্ত।
		
		এটি প্রাচীনতম সভ্যতার একটি অংশ, যেখানে ঐতিহাসিক স্থান, ধর্ম, ও সংস্কৃতির মিশেলে মনোহর নির্মিত হয়েছে। বাংলাদেশের সংস্কৃতি এবং ঐতিহাসিক প্রাচীন্য বিশ্বের সবচেয়ে গৌরবময় সম্পদ।
		
		এটি যেখানে প্রকৃতি বিচরণ করে তার সৌন্দর্য সবসময় মানুষের হৃদয়ে আনন্দ এবং আনন্দ তৈরি করে। বাংলাদেশের ভাষা, সাংস্কৃতিক উপাদান, উন্নয়নের গতি এবং দারিদ্র্য ও শোষণ নিয়ে জিজ্ঞাসা তার মানুষের অন্তর হৃদয়ে স্থাপিত করে তাদের বাস্তবায়ন এবং তাদের আত্মবিশ্বাস বাড়াতে সাহায্য করে।</p>`,
		photo: "uploads/posts/bn1.jpg",
		photo_alt_text: "আমার বাংলাদেশ",
		seo_title: "আমার বাংলাদেশ",
		seo_keyword: "আমার বাংলাদেশ",
		seo_description: "আমার বাংলাদেশ",
		seo_schema_tags: "আমার বাংলাদেশ",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba7'],
		comments:[],
		status: true,
	},
	{
		title: "বাংলাদেশের অর্থনীতি ও উন্নয়ন",
		subtitle: "বাংলাদেশের অর্থনীতি, উন্নয়ন প্রস্তুতি ও প্রজন্মের সমস্যাগুলি নিয়ে আলোচনা করা হয়।",
		short_description: `<p>বাংলাদেশের অর্থনীতি এবং উন্নয়ন একটি দৃঢ় এবং গুরুত্বপূর্ণ বিষয়। দেশের অর্থনীতি পরিচালিত হয় এবং সরকার।</p>`,
		description: `<p>বাংলাদেশের অর্থনীতি এবং উন্নয়ন একটি দৃঢ় এবং গুরুত্বপূর্ণ বিষয়। দেশের অর্থনীতি পরিচালিত হয় এবং সরকার এবং বেসরকারি সেক্টরের মধ্যে সম্প্রদায়ের উন্নতি এবং সমস্যা সমাধানের মাধ্যমে এগিয়ে যায়।

		বাংলাদেশের অর্থনীতি প্রধানতঃ কৃষি-ভিত্তিক, তবে সেটি শিগগিরই উন্নয়নের মাধ্যমে উত্তরাধিকারী অর্থনৈতিক সেক্টরে পরিণত হতে যাচ্ছে। অত্যন্ত গুরুত্বপূর্ণ ক্ষেত্র হলো গার্মেন্টস, প্রস্তুত পণ্য পরিচালনা, নৌবাহন ও পরিবহন ব্যবসায়।
		
		সরকারের দ্বারা শিক্ষা, স্বাস্থ্য, প্রযুক্তি ও প্রকৌশলী উন্নয়নে বেশি গুরুত্ব দেওয়া হচ্ছে। প্রযুক্তির ব্যাপক ব্যবহার এবং ডিজিটাল সেবা
		
		বাংলাদেশে উন্নয়নের উপায়ে সরকার মূলত কৃষি, শিক্ষা, প্রযুক্তি এবং প্রকৌশল সেক্টরে মাধ্যমে এগিয়ে যাওয়ার চেষ্টা করছে। সুতরাং, উন্নয়নে বিপণ্ডী প্রয়োগ করা হয়েছে এবং সেই অভিজ্ঞতা থেকে অনুমোদিত পরিকল্পনা গুলি কার্যান্বিত করা হচ্ছে।
		
		অর্থনীতি এবং উন্নয়নের ক্ষেত্রে বাংলাদেশ এখন প্রগতিশীল পথে অগ্রসর হতে চলেছে, এবং তার ভবিষ্যৎ সামর্থ্যশীলতার সাথে সম্পর্কিত মূল প্রতিষ্ঠান গড়ে তুলছে। সে দিকে, বাংলাদেশ উন্নয়নের পথে নতুন উচ্চায় পেয়ে যাচ্ছে এবং বিভিন্ন অর্থনীতি প্রক্রিয়া এবং উন্নয়ন প্রকল্পে নতুন অংশগ্রহণ করছে।</p>`,
		photo: "uploads/posts/bn2.jpg",
		photo_alt_text: "বাংলাদেশের অর্থনীতি ও উন্নয়ন",
		seo_title: "বাংলাদেশের অর্থনীতি ও উন্নয়ন",
		seo_keyword: "বাংলাদেশের অর্থনীতি ও উন্নয়ন",
		seo_description: "বাংলাদেশের অর্থনীতি ও উন্নয়ন",
		seo_schema_tags: "বাংলাদেশের অর্থনীতি ও উন্নয়ন",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba7'],
		comments:[],
		status: true,
	},
	{
		title: "বাংলাদেশের পর্যটন স্থান",
		subtitle: "বাংলাদেশের প্রাকৃতিক সৌন্দর্য, ঐতিহাসিক স্থান এবং ভ্রমণ সম্পর্কিত তথ্য ও অভিজ্ঞতা।",
		short_description: `<p>বাংলাদেশ একটি অদ্ভুত পর্যটন গন্তব্য, যেখানে প্রাকৃতিক সৌন্দর্য, ঐতিহাসিক স্থান, সাংস্কৃতিক বৈশিষ্ট্য এবং ব্যক্তিগত অভিজ্ঞতা একত্রে</p>`,
		description: `<p>বাংলাদেশ একটি অদ্ভুত পর্যটন গন্তব্য, যেখানে প্রাকৃতিক সৌন্দর্য, ঐতিহাসিক স্থান, সাংস্কৃতিক বৈশিষ্ট্য এবং ব্যক্তিগত অভিজ্ঞতা একত্রে মিশে একটি অবিস্মরণীয় অভিজ্ঞতা প্রদান করে। দেশটি ব্যাপক বৈচিত্র্যের সমৃদ্ধ কালেকশন অফার করে, যা ভ্রমণকারীদের সমৃদ্ধ অভিজ্ঞতা এবং আনন্দ অর্জন করে।

		বাংলাদেশের প্রাকৃতিক সৌন্দর্য অবাক করা। সুন্দর নদী, জলপ্রপাত, নীলাঞ্জনা বন, চমৎকার পাহাড় এবং দরিয়াপ্রান্তের প্রাকৃতিক রমণীয়তা পর্যটকদের আকর্ষণ করে। সুন্দরবন, কক্সবাজারের সমুদ্র সৈকত, সাজেক ভ্রমণ, সুনামগঞ্জের তেঙ্গুয়া ঝর্না, রাঙামাটির সুহলচঁপ জলপ্রপাত ইত্যাদি দেশের অন্যতম জনপ্রিয় প্রাকৃতিক গন্তব্য।
		
		ঐতিহাসিক স্থানগুলি বাংলাদেশের ঐতিহ্যবাহি প্রতীক। মহাস্থানগড়, পাহাড়াপুর বৌদ্ধ বিহার, মহাস্থানগড়ের সোমাপুর বিহার, পহাড়পুর বিশ্ববিদ্যালয় এবং ঢাকার ঐতিহাসিক জাদুঘর মিউজিয়াম প্রাচীন ঐতিহ্যবাহী স্থানের মধ্যে অন্যতম।</p>`,
		photo: "uploads/posts/bn3.jpg",
		photo_alt_text: "বাংলাদেশের পর্যটন স্থান",
		seo_title: "বাংলাদেশের পর্যটন স্থান",
		seo_keyword: "বাংলাদেশের পর্যটন স্থান",
		seo_description: "বাংলাদেশের পর্যটন স্থান",
		seo_schema_tags: "বাংলাদেশের পর্যটন স্থান",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba7'],
		comments:[],
		status: true,
	},
	{
		title: "বাংলাদেশের সাহিত্য ও শিল্প",
		subtitle: "বাংলাদেশের সাহিত্য, শিল্প ও সাংস্কৃতিক ঘটনার বিষয়ে আরও জানুন।",
		short_description: `<p>বাংলাদেশের সাহিত্য ও শিল্প একটি অমূল্য সংস্কৃতি এবং ঐতিহাসিক ধর্ম যা দেশের সম্প্রতি এবং প্রাচীন পর্যায়ে সমৃদ্ধি এবং বিবেকের প্রতিবিম্বন করে। </p>`,
		description: `<p>বাংলাদেশের সাহিত্য ও শিল্প একটি অমূল্য সংস্কৃতি এবং ঐতিহাসিক ধর্ম যা দেশের সম্প্রতি এবং প্রাচীন পর্যায়ে সমৃদ্ধি এবং বিবেকের প্রতিবিম্বন করে। বাংলাদেশের সাহিত্য ও শিল্প সমৃদ্ধ এবং বৈশিষ্ট্যপূর্ণ, যা দেশের ঐতিহ্য, সাংস্কৃতিক বৈশিষ্ট্য এবং মানবিক অভিজ্ঞতার সমন্বয়ে উত্পন্ন হয়েছে।

		বাংলাদেশের সাহিত্য অত্যন্ত সমৃদ্ধ এবং বিভিন্ন ধারায় বিভক্ত। সাহিত্যের প্রথম ধারা এখানে রচনাশৈলী, কবিতা, উপন্যাস, ছোটগল্প, নাটক এবং অন্যান্য শ্রেণিগুলির মাধ্যমে বিশেষভাবে প্রকাশ পায়। বাংলাদেশের সাহিত্য একটি সুন্দর সম্পদ, যা মানব মনোভাব, বিচারধারা, বিভাবনা এবং ধারাবাহিক উন্নতির প্রতিফলিত ফলাফল।
		
		বাংলাদেশের সাহিত্যের অংশ হিসেবে কবিতা একটি গুরুত্বপূর্ণ সাহিত্যিক শ্রেণি, যা ভাবনার একটি অত্যন্ত সুন্দর মাধ্যম। বাংলাদেশের কবিতা সাধারণভাবে প্রকৃতি, মানুষ, ভালোবাসা, সমাজ এবং সাংস্কৃতিক বিষয়গুলির উপর ভিত্তি করে। এটি সমাজের জীবনের বিভিন্ন মাধ্যমের মাধ্যমে সমাজের ধারাবাহিক উন্নতি এবং বিচারের প্রতিবিম্বন করে।</p>`,
		photo: "uploads/posts/bn4.jpg",
		photo_alt_text: "বাংলাদেশের সাহিত্য ও শিল্প",
		seo_title: "বাংলাদেশের সাহিত্য ও শিল্প",
		seo_keyword: "বাংলাদেশের সাহিত্য ও শিল্প",
		seo_description: "বাংলাদেশের সাহিত্য ও শিল্প",
		seo_schema_tags: "বাংলাদেশের সাহিত্য ও শিল্প",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba7'],
		comments:[],
		status: true,
	},
	{
		title: "বাংলাদেশের ধর্ম ও সাংস্কৃতিক প্রথা",
		subtitle: "বাংলাদেশের বিভিন্ন ধর্ম, সাংস্কৃতিক প্রথা ও উৎসবের তথ্য ও অভিজ্ঞতা।",
		short_description: `<p>বাংলাদেশের ধর্ম ও সাংস্কৃতিক প্রথা একটি বিস্তৃত এবং ভিন্নস্বাদের মিশ্রণ যা দেশের সমাজকে ব্যাপকভাবে আবদ্ধ করে।</p>`,
		description: `<p>বাংলাদেশের ধর্ম ও সাংস্কৃতিক প্রথা একটি বিস্তৃত এবং ভিন্নস্বাদের মিশ্রণ যা দেশের সমাজকে ব্যাপকভাবে আবদ্ধ করে। বাংলাদেশের সাংস্কৃতিক প্রথা একটি নিরপেক্ষ আদর্শ, যা বিভিন্ন ধর্ম, পরম্পরা, অনুষ্ঠান এবং ভাবনা সমৃদ্ধ করে।

		ধর্মের দৃষ্টিতে, বাংলাদেশ একটি বিশাল ধার্মিক মেলা এবং একই সাথে একটি সাম্প্রদায়িক সাহিত্য, সংস্কৃতি এবং চিত্রার সামৃদ্ধ্য ধারণ করে। ইসলাম এবং হিন্দুধর্ম হলো দুটি প্রধান ধর্ম যা বাংলাদেশে অনুসরণ করা হয়। বাংলাদেশ একটি ধর্মনিরপেক্ষ দৃষ্টিভঙ্গিতে সমৃদ্ধ এবং সামাজিক কোমলতা এনে দিয়েছে যা ধর্মীয় বৈষম্য বাতিল করে।
		
		বাংলাদেশের সাংস্কৃতিক প্রথা বিভিন্ন আদিবাসী সম্প্রদায়, উন্নয়নশীল সমৃদ্ধ ঐতিহ্যিক বিল্ডিং, উপভোগ্য খাবার এবং উৎসবের সাথে নিকটতম। পহেলা বৈশাখ (বাংলা নববর্ষ), ধর্মীয় উৎসব, বিবাহ উৎসব, জন্মাষ্টমী, ঈদ, দুর্গা পূজা, ক্রিস্টমাস, বুদ্ধ পূর্ণিমা ইত্যাদি সমাজের গুরুত্বপূর্ণ উৎসব ও উৎসবগুলি।</p>`,
		photo: "uploads/posts/bn5.jpg",
		photo_alt_text: "বাংলাদেশের ধর্ম ও সাংস্কৃতিক প্রথা",
		seo_title: "বাংলাদেশের ধর্ম ও সাংস্কৃতিক প্রথা",
		seo_keyword: "বাংলাদেশের ধর্ম ও সাংস্কৃতিক প্রথা",
		seo_description: "বাংলাদেশের ধর্ম ও সাংস্কৃতিক প্রথা",
		seo_schema_tags: "বাংলাদেশের ধর্ম ও সাংস্কৃতিক প্রথা",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba7'],
		comments:[],
		status: true,
	},
	{
		title: "বাংলাদেশের কৃষি ও সংগ্রহণ",
		subtitle: "বাংলাদেশের কৃষি উন্নয়ন, ফসল প্রযুক্তি, কৃষি প্রণালী ও বিষয়ক ব্লগ।",
		short_description: `<p>বাংলাদেশের কৃষি ও ফসল অত্যন্ত গুরুত্বপূর্ণ একটি বিষয়। এটি দেশের অর্থনৈতিক উন্নয়নের মৌলিক অংশ এবং মানব প্রবৃদ্ধির স্তম্ভ।</p>`,
		description: `<p>বাংলাদেশের কৃষি ও ফসল অত্যন্ত গুরুত্বপূর্ণ একটি বিষয়। এটি দেশের অর্থনৈতিক উন্নয়নের মৌলিক অংশ এবং মানব প্রবৃদ্ধির স্তম্ভ। বাংলাদেশের মুখ্য অর্থনৈতিক সংস্থান হিসেবে কৃষি একটি মৌলিক অংশ যা মোট জনসংখ্যার বেশিরভাগের জীবনযাপনে নির্ভর করে।

		বাংলাদেশের জমির প্রায় ৭০% কৃষিজমি এবং এই যায়গায় মূলত দুটি মৌসুমে ফসল উৎপাদন হয়। ধান, পাট, গম, মুগ, আদা, পেঁয়াজ, আম, আপেল, লেবু, কাঁঠাল, আমড়া, আঙ্গুর, কমলা, ফজলা ইত্যাদি হলুদ ও উদ্ভিদ সমূহ প্রধান ফসলের মধ্যে অন্যতম। বাংলাদেশ বিশ্বের অন্যতম প্রধান ধান উৎপাদনকারী দেশের মধ্যে অন্যতম একটি।
		
		কৃষি সেক্টর বাংলাদেশের অর্থনৈতিক অগ্রগতির জন্য মৌলিক ভূমিকা পালন করেছে। কৃষি একটি বিশাল শ্রমিক সম্প্রদায় সৃষ্টি করে এবং অধিকাংশ গ্রামবাসীর প্রাথমিক আয়ের উৎস। তারা প্রাকৃতিক রক্ষা করে এবং উন্নত প্রযুক্তি এবং প্রত্যাশার সাথে তাদের ফসলের উৎপাদন বাড়াতে চেষ্টা করে।
		
		বাংলাদেশের কৃষি ও ফসল সেক্টরের উন্নতির জন্য সরকার এবং বিভাগীয় সংস্থা সম্প্রদায়ের সাথে নতুন প্রযুক্তিগত সংশোধন এবং উন্নয়ন সম্পর্কে প্রচুর প্রচেষ্টা চালাচ্ছে। প্রযুক্তিগত উন্নয়ন, সাইন্স এবং প্রযুক্তির অনুপ্রেরণা সহজে বাংলাদেশের কৃষিক্ষেত্রে প্রবৃদ্ধি করেছে।</p>`,
		photo: "uploads/posts/bn6.jpg",
		photo_alt_text: "বাংলাদেশের কৃষি ও সংগ্রহণ",
		seo_title: "বাংলাদেশের কৃষি ও সংগ্রহণ",
		seo_keyword: "বাংলাদেশের কৃষি ও সংগ্রহণ",
		seo_description: "বাংলাদেশের কৃষি ও সংগ্রহণ",
		seo_schema_tags: "বাংলাদেশের কৃষি ও সংগ্রহণ",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba7'],
		comments:[],
		status: true,
	},


	// ইসলামী আন্দোলন
	{
		title: "ইসলামী আন্দোলনের ইতিহাস ও প্রবণতা",
		subtitle: "বাংলাদেশে ইসলামী আন্দোলনের ইতিহাস, আন্দোলনের আদিম থেকে আধুনিক ধারাবাহিকতা নিয়ে লেখা হতে পারে।",
		short_description: `<p>ইসলামী আন্দোলনের ইতিহাস ও প্রবণতা" একটি অত্যন্ত গভীরভাবে মৌলিক বিষয় যা ইসলামী সমাজের সামাজিক, রাজনৈতিক ও ধর্মীয় পরিবর্তন সম্পর্কে বিস্তারিত তথ্য সরবরাহ করে।</p>`,
		description: `<p>ইসলামী আন্দোলনের ইতিহাস ও প্রবণতা" একটি অত্যন্ত গভীরভাবে মৌলিক বিষয় যা ইসলামী সমাজের সামাজিক, রাজনৈতিক ও ধর্মীয় পরিবর্তন সম্পর্কে বিস্তারিত তথ্য সরবরাহ করে। এটি একটি ঐতিহাসিক অধ্যয়ন, যা ইসলামের আগমন থেকে দ্বিতীয় খিলাফতের সময়, বিশ্ববিদ্যালয়ের স্থাপনা, সামাজিক পরিবর্তন, বিভিন্ন ইসলামী আন্দোলনের উদ্ভাবন এবং তাদের কাজের বিষয়ে বিস্তৃত তথ্য সরবরাহ করে।

		এই ইতিহাস সম্পর্কে লিখা হতে পারে যে ভাবে ইসলামী ধর্মের মূল উদ্দেশ্য বোঝা হয়েছিল এবং কীভাবে ইসলামের প্রতিষ্ঠানার্থে আন্দোলনের সমর্থকদের অনুসরণ হয়েছিল। ইতিহাসের বিভিন্ন যুগে ইসলামী আন্দোলনের ভূমিকা, নেতৃত্ব, এবং তার প্রভাব উল্লেখ করা হতে পারে। এছাড়াও, ইসলামী আন্দোলনের ইতিহাস প্রবণতা নিয়ে লেখা হতে পারে যে ভাবে ইসলামী আন্দোলন বিভিন্ন সময়ে বিভিন্ন প্রকারে উঠেছিল এবং তার উদ্দেশ্য ছিল কী।
		
		এই বিষয়টি লেখার মাধ্যমে, ইসলামী আন্দোলনের বিকাশ, সামাজিক পরিবর্তন, রাজনৈতিক দক্ষতা, ধর্মীয় অবতারণা, এবং ইসলামী মূল উদ্দেশ্যের প্রতি মানুষের আত্মবিশ্বাস এবং নিরাপত্তার প্রতি ভরসা বাড়ানোর প্রতি আলোচনা করা হয়।</p>`,
		photo: "uploads/posts/ia1.jpg",
		photo_alt_text: "ইসলামী আন্দোলনের ইতিহাস ও প্রবণতা",
		seo_title: "ইসলামী আন্দোলনের ইতিহাস ও প্রবণতা",
		seo_keyword: "ইসলামী আন্দোলনের ইতিহাস ও প্রবণতা",
		seo_description: "ইসলামী আন্দোলনের ইতিহাস ও প্রবণতা",
		seo_schema_tags: "ইসলামী আন্দোলনের ইতিহাস ও প্রবণতা",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba5'],
		comments:[],
		status: true,
	},
	{
		title: "ইসলামী আন্দোলনের রাজনৈতিক প্রভাব",
		subtitle: "ইসলামী আন্দোলনের রাজনৈতিক প্রভাব, রাজনৈতিক অস্তিত্ব ও ইতিহাস নিয়ে ব্লগ লেখা হয়।",
		short_description: `<p>ইসলামী আন্দোলনের রাজনৈতিক প্রভাব" একটি গভীরভাবে গবেষিত বিষয় যা ইসলামী আন্দোলনের প্রভাব ও তার রাজনৈতিক পরিণাম সম্পর্কে বিস্তারিত বিবরণ সরবরাহ করে। </p>`,
		description: `<p>ইসলামী আন্দোলনের রাজনৈতিক প্রভাব" একটি গভীরভাবে গবেষিত বিষয় যা ইসলামী আন্দোলনের প্রভাব ও তার রাজনৈতিক পরিণাম সম্পর্কে বিস্তারিত বিবরণ সরবরাহ করে। এটি ইসলামিক ধর্মের ভিত্তিতে প্রাচীন এবং আধুনিক বিশ্বাসের উদ্ভাবন, অবতারণা, এবং তার রাজনৈতিক প্রভাব নির্ধারণ করে।

		ইসলামী আন্দোলন এবং তার রাজনৈতিক প্রভাব বিষয়ে লেখা হতে পারে যে ভাবে ইসলামের আদিম ধারাবাহিকতা, রাজনৈতিক সিদ্ধান্ত ও শাসন সিদ্ধান্ত, রাষ্ট্রীয় ও আন্তর্জাতিক রাজনৈতিক ব্যবস্থা, সরকারি নীতি নির্ধারণ, শাসকের প্রশাসন, এবং ইসলামী ভিত্তিতে রাজনৈতিক স্বাধীনতা ও নাগরিক অধিকার সম্পর্কে উল্লেখ করা হতে পারে।
		
		এই বিষয়ে লেখা হতে পারে যে ভাবে ইসলামী আন্দোলন রাজনৈতিক পরিবর্তনের সাধারণ ক্ষেত্রে প্রভাবিত হয়েছিল এবং প্রভাব দেন সরকারি নীতি নির্ধারণে এবং প্রতিষ্ঠানার কাজে। এছাড়াও, ইসলামী আন্দোলনের রাজনৈতিক প্রভাব সামাজিক সংস্কৃতির প্রতি মানুষের আত্মবিশ্বাস এবং প্রতিরক্ষা এবং নাগরিক অধিকারের প্রতি নিরাপত্তার সম্পর্কে উপস্থাপনা করে।
		
		এই ধরনের ব্লগে প্রাচীন এবং আধুনিক ইসলামী আন্দোলন নিয়ে বিভিন্ন দিক নিয়ে আলোচনা করা হতে পারে, যা একটি বিশেষ রাজনৈতিক পরিবর্তন বা সমাজের রাজনৈতিক পরিবর্তনের চেষ্টা নির্দেশ করে।</p>`,
		photo: "uploads/posts/ia2.jpg",
		photo_alt_text: "ইসলামী আন্দোলনের রাজনৈতিক",
		seo_title: "ইসলামী আন্দোলনের রাজনৈতিক",
		seo_keyword: "ইসলামী আন্দোলনের রাজনৈতিক",
		seo_description: "ইসলামী আন্দোলনের রাজনৈতিক",
		seo_schema_tags: "ইসলামী আন্দোলনের রাজনৈতিক",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba5'],
		comments:[],
		status: true,
	},
	{
		title: "ইসলামী শিক্ষা ও সংস্কৃতির ব্যবস্থা",
		subtitle: "ইসলামী শিক্ষা প্রণালী, সাংস্কৃতিক ব্যবস্থা এবং ইসলামী সংস্কৃতির ব্যবস্থা সম্পর্কে ব্লগ লেখা হতে পারে।",
		short_description: `<p>ইসলামী শিক্ষা ও সংস্কৃতির ব্যবস্থা" একটি গুরুত্বপূর্ণ বিষয়, যা ইসলামী সমাজের শিক্ষা ও সংস্কৃতির বিভিন্ন দিক সম্পর্কে বিস্তারিত তথ্য সরবরাহ করে।</p>`,
		description: `<p>ইসলামী শিক্ষা ও সংস্কৃতির ব্যবস্থা" একটি গুরুত্বপূর্ণ বিষয়, যা ইসলামী সমাজের শিক্ষা ও সংস্কৃতির বিভিন্ন দিক সম্পর্কে বিস্তারিত তথ্য সরবরাহ করে। এটি ইসলামের ব্যক্তিগত ও সামাজিক শিক্ষার ভূমিকা, সাংস্কৃতিক অনুষ্ঠান, শিক্ষার পদ্ধতি, ইসলামিক শিক্ষার ব্যবস্থা এবং ইসলামিক সংস্কৃতির বিভিন্ন দিক নিয়ে অনুসন্ধান করে।

		এই বিষয়ে লিখা হতে পারে যে ভাবে ইসলামের অধীনে শিক্ষা প্রণালী গঠন করা হয়েছিল এবং কীভাবে ইসলামিক শিক্ষা ও সংস্কৃতির উন্নতি এবং বিকাশে ভূমিকা রাখে। এছাড়াও, ইসলামিক শিক্ষা ব্যবস্থা সম্পর্কে লেখা হতে পারে যে ভাবে ইসলামী সাংস্কৃতিক মান ও মৌলিক শিক্ষার মধ্যে সম্পর্ক রয়েছে।
		
		এছাড়াও, ইসলামী শিক্ষা ও সংস্কৃতির ব্যবস্থা নিয়ে লেখা হতে পারে যে ভাবে ইসলামিক শিক্ষার মাধ্যমে বিভিন্ন সামাজিক মূল্য ও নৈতিকতা বৃদ্ধি করা হয় এবং তার প্রতি শিক্ষার্থীদের অবদান। ইসলামী সংস্কৃতির ব্যবস্থা নিয়ে লেখা হতে পারে যে ভাবে ইসলামী সংস্কৃতি সামাজিক ও সাংস্কৃতিক অনুষ্ঠানে বিভিন্ন রীতিমত ভূমিকা পালন করে এবং সমাজের জীবনের প্রতি প্রভাব ফেলে।
		
		এই ধরনের ব্লগ প্রকাশের মাধ্যমে ইসলামী শিক্ষা ও সংস্কৃতির বিভিন্ন দিক নিয়ে বিস্তারিত আলোচনা করা হতে পারে, যা সমাজের পরিবর্তন এবং প্রগতিতে ভূমিকা রাখে।</p>`,
		photo: "uploads/posts/ia3.jpg",
		photo_alt_text: "ইসলামী শিক্ষা ও সংস্কৃতির ব্যবস্থা",
		seo_title: "ইসলামী শিক্ষা ও সংস্কৃতির ব্যবস্থা",
		seo_keyword: "ইসলামী শিক্ষা ও সংস্কৃতির ব্যবস্থা",
		seo_description: "ইসলামী শিক্ষা ও সংস্কৃতির ব্যবস্থা",
		seo_schema_tags: "ইসলামী শিক্ষা ও সংস্কৃতির ব্যবস্থা",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba5'],
		comments:[],
		status: true,
	},
	{
		title: "ইসলামী আন্দোলনের সুযোগ-সুবিধা",
		subtitle: "ইসলামী আন্দোলনের বিভিন্ন অংশে সুযোগ-সুবিধা সম্পর্কে লেখা হয়।",
		short_description: `<p>ইসলামী আন্দোলনের সুযোগ-সুবিধা" একটি বিশেষ বিষয়, যা ইসলামী আন্দোলনের কার্যকারীতা এবং তার প্রভাব নিয়ে বিস্তারিত তথ্য সরবরাহ করে।</p>`,
		description: `<p>ইসলামী আন্দোলনের সুযোগ-সুবিধা" একটি বিশেষ বিষয়, যা ইসলামী আন্দোলনের কার্যকারীতা এবং তার প্রভাব নিয়ে বিস্তারিত তথ্য সরবরাহ করে। ইসলামী আন্দোলন নির্দেশনা বা পরিপ্রেক্ষিতে সুযোগ-সুবিধা প্রদান করে, যাতে ইসলামী সমাজের প্রতিষ্ঠান এবং অধিকারের বিষয়ে সুযোগ ও সুবিধা সঠিকভাবে বোঝা যায়।

		এই বিষয়ে লেখা হতে পারে যে ভাবে ইসলামী আন্দোলন এবং তার কার্যকারিতা মাধ্যমে সমাজের প্রতি সচেতনতা উত্থান এবং জনগণের ভাবনা প্রবৃদ্ধি করে। ইসলামী আন্দোলন সাধারণভাবে সামাজিক, রাজনৈতিক ও ধর্মীয় পরিবর্তন চায় এবং তার মাধ্যমে মানুষের সাধারণ জীবনের সুধারনা হয়।
		
		এছাড়াও, ইসলামী আন্দোলনের সুযোগ-সুবিধা নিয়ে লেখা হতে পারে যে ভাবে ইসলামী আন্দোলনের মাধ্যমে সমাজের অনুষ্ঠানের প্রতি আগ্রহ বাড়াতে সাহায্য করে এবং কীভাবে ইসলামিক সমাজের মাধ্যমে মানুষের প্রতি সম্মান এবং সমানতা বৃদ্ধি করা হয়।
		
		এই ধরনের ব্লগ সাধারণভাবে ইসলামী আন্দোলনের কার্যকারিতা এবং তার সুযোগ-সুবিধা নিয়ে বিভিন্ন দিক নিয়ে আলোচনা করে, যা সামাজিক পরিবর্তনের এবং মানুষের প্রগতির দিকে নতুন দৃষ্টিভঙ্গি প্রদান করে।</p>`,
		photo: "uploads/posts/ia4.jpg",
		photo_alt_text: "আন্দোলনের সুযোগ-সুবিধা",
		seo_title: "আন্দোলনের সুযোগ-সুবিধা",
		seo_keyword: "আন্দোলনের সুযোগ-সুবিধা",
		seo_description: "আন্দোলনের সুযোগ-সুবিধা",
		seo_schema_tags: "আন্দোলনের সুযোগ-সুবিধা",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba5'],
		comments:[],
		status: true,
	},
	{
		title: "ইসলামী আন্দোলন ও সামাজিক পরিবর্তন",
		subtitle: "ইসলামী আন্দোলনের সামাজিক পরিবর্তন, সামাজিক সংস্কৃতি ও পরিবারের ভূমিকা নিয়ে লেখা হতে পারে।",
		short_description: `<p>ইসলামী আন্দোলন ও সামাজিক পরিবর্তন" একটি গভীরভাবে ব্যাখ্যা করা যায় যেটি ইসলামী ধারাবাহিকতা, নৈতিকতা,। </p>`,
		description: `<p>ইসলামী আন্দোলন ও সামাজিক পরিবর্তন" একটি গভীরভাবে ব্যাখ্যা করা যায় যেটি ইসলামী ধারাবাহিকতা, নৈতিকতা, ও সামাজিক ন্যায় প্রয়োগ করে বিভিন্ন সামাজিক ও নৈতিক সমস্যার সামাধান করার চেষ্টা করে। এটি একটি সাংস্কৃতিক, ধারাবাহিক এবং নৈতিক পরিবর্তনের উদ্দেশ্যে ইসলামি মূলনীতি ও শিক্ষা ব্যবহার করে।

		এই বিষয়ে লেখা হতে পারে যে ভাবে ইসলামী আন্দোলন সামাজিক পরিবর্তনের জন্য একটি গুরুত্বপূর্ণ উপায় হিসেবে কাজ করেছিল। ইসলামী আন্দোলন সামাজিক অন্যান্য ধারাবাহিক পরিবর্তনের জন্য শক্তিশালী মাধ্যম হিসেবে মনোনিবেশিত ছিল। এটি বিভিন্ন সামাজিক মানদণ্ড, নৈতিকতা, মানবিকতা এবং সমাজের সামাজিক অবস্থানের প্রতি প্রভাব ফেলে।
		
		ইসলামী আন্দোলন ও সামাজিক পরিবর্তন নিয়ে লেখা হতে পারে যে ভাবে এটি মানুষের মানবিক অধিকার, ন্যায় ও সমানতা বিষয়ে চিন্তামূলক পরিবর্তন এনেছিল। এছাড়াও, ইসলামী আন্দোলনের মাধ্যমে সামাজিক অসমতা, অগত্যা, সমাজের বিভিন্ন নেতৃত্বের বিরুদ্ধে লড়াই চালানো হয়েছিল। এর মাধ্যমে সামাজিক অবস্থানের প্রতি সচেতনতা ও মানবিকতা বাড়ানো হয়েছিল।</p>`,
		photo: "uploads/posts/ia5.jpg",
		photo_alt_text: "ইসলামী আন্দোলন ও সামাজিক পরিবর্তন",
		seo_title: "ইসলামী আন্দোলন ও সামাজিক পরিবর্তন",
		seo_keyword: "ইসলামী আন্দোলন ও সামাজিক পরিবর্তন",
		seo_description: "ইসলামী আন্দোলন ও সামাজিক পরিবর্তন",
		seo_schema_tags: "ইসলামী আন্দোলন ও সামাজিক পরিবর্তন",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba5'],
		comments:[],
		status: true,
	},
	{
		title: "ইসলামী আন্দোলনের ও ধর্মীয় অধিকার",
		subtitle: "ইসলামী আন্দোলনের ধর্মীয় অধিকার এবং সহিংসতার প্রতিরোধের বিষয়ে ব্লগ লেখা হতে পারে।",
		short_description: `<p>ইসলামী আন্দোলনের ও ধর্মীয় অধিকার" একটি গুরুত্বপূর্ণ বিষয়, যা ইসলামী ধারাবাহিকতা, ধর্মীয় স্বাধীনতা এবং ধর্মীয় অধিকারের বিভিন্ন দিক নিয়ে আলোচনা করে।</p>`,
		description: `<p>ইসলামী আন্দোলনের ও ধর্মীয় অধিকার" একটি গুরুত্বপূর্ণ বিষয়, যা ইসলামী ধারাবাহিকতা, ধর্মীয় স্বাধীনতা এবং ধর্মীয় অধিকারের বিভিন্ন দিক নিয়ে আলোচনা করে। এটি ইসলামী ধর্মের প্রতিষ্ঠান ও প্রচার-প্রসারের মাধ্যমে মানুষের ধর্মীয় অধিকার এবং স্বাধীনতার প্রতি জাগরুকতা বৃদ্ধি করে।

		ইসলামী আন্দোলন ধর্মীয় অধিকার নিয়ে লেখা হতে পারে যে ভাবে ইসলাম মানুষের ধর্মীয় অধিকার এবং স্বাধীনতা প্রতি গৌরবময় এবং অবিচ্ছিন্নভাবে সম্মান প্রদান করে। ইসলাম অনুসারে ধর্মীয় অধিকারের প্রতি মানবীয় অধিকার এবং সমানতা অপরিহার্যতা অনুভব করা উচিত।
		
		এছাড়াও, ইসলামী আন্দোলনের মাধ্যমে ধর্মীয় অধিকার এবং স্বাধীনতা প্রবর্তনের উদ্দেশ্যে সরকারী ও অরাজনৈতিক প্রতিষ্ঠানের বিরুদ্ধে আলোচনা ও প্রতিষ্ঠান করা হয়েছিল। এটি বিভিন্ন ধর্মীয় অধিকারের অনুসন্ধান এবং প্রতিষ্ঠানের প্রশাসনের মাধ্যমে ধর্মীয় স্বাধীনতা ও অধিকার বিকাশ করে।</p>`,
		photo: "uploads/posts/ia6.jpg",
		photo_alt_text: "ইসলামী আন্দোলনের ও ধর্মীয় অধিকার",
		seo_title: "ইসলামী আন্দোলনের ও ধর্মীয় অধিকার",
		seo_keyword: "ইসলামী আন্দোলনের ও ধর্মীয় অধিকার",
		seo_description: "ইসলামী আন্দোলনের ও ধর্মীয় অধিকার",
		seo_schema_tags: "ইসলামী আন্দোলনের ও ধর্মীয় অধিকার",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba5'],
		comments:[],
		status: true,
	},

	// ইসলাম
	{
		title: "ইসলামের মূল শিক্ষা",
		subtitle: "ইসলামের মূল সিদ্ধান্ত, আল-কোরআন এবং হাদিস নিয়ে ব্লগ লেখা হতে পারে",
		short_description: `<p>ইসলামের মূল শিক্ষা" একটি গভীরভাবে ব্যাখ্যা করা যেটি ইসলামের মৌলিক বিষয়গুলির উপর ভিত্তি করে।</p>`,
		description: `<p>ইসলামের মূল শিক্ষা" একটি গভীরভাবে ব্যাখ্যা করা যেটি ইসলামের মৌলিক বিষয়গুলির উপর ভিত্তি করে। এটি ইসলামের ধারাবাহিক তত্ত্ব, মূলনীতি, আদর্শ ও নৈতিক উপদেশগুলির উপর ভিত্তি করে লেখা হয়।

		ইসলামের মূল শিক্ষা নিয়ে লেখা হতে পারে যে ভাবে ইসলাম মানুষের জীবনের প্রতিটি দিকে প্রভাব ফেলে, এবং কীভাবে এটি ব্যক্তির নৈতিক ও ধারাবাহিক জীবনের স্তর বাড়াতে সাহায্য করে।
		
		ইসলামের মূল শিক্ষা নিয়ে লেখা হতে পারে যে ভাবে ইসলাম মানুষের মধ্যে শান্তি, সহিষ্ণুতা, সমানতা, সহযোগিতা এবং সত্যের প্রতি আদর উপদেশ দেয়। ইসলামের মূল শিক্ষা বিভিন্ন ধর্মীয় গুরুত্বপূর্ণ বিষয়ে লেখা হতে পারে, যেমন তাওহীদ (একতা আর প্রভুতা), নবীদের মহানতা, নিয়ামত ও আখিরাত (মৃত্যুর পরের জীবন) ইত্যাদি।
		
		ইসলামের মূল শিক্ষা বিষয়ে লেখা হতে পারে যে ভাবে ইসলাম মানুষের জীবনের সকল দিকে সামাজিক ও নৈতিক মান অনুষ্ঠান করার উদ্দেশ্যে অনুপ্রেরণা দেয়। এটি মানুষের মধ্যে একটি সুস্থ ও সম্মানজনক সমাজ গড়ে তোলার জন্য প্রতিষ্ঠান করে।</p>`,
		photo: "uploads/posts/is6.png",
		photo_alt_text: "ইসলামের মূল শিক্ষা",
		seo_title: "ইসলামের মূল শিক্ষা",
		seo_keyword: "ইসলামের মূল শিক্ষা",
		seo_description: "ইসলামের মূল শিক্ষা",
		seo_schema_tags: "ইসলামের মূল শিক্ষা",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba3'],
		comments:[],
		status: true,
	},
	{
		title: "ইসলামের সমাজ ও শিক্ষা",
		subtitle: "ইসলামের সামাজিক আদর্শ, শিক্ষা এবং পরিবার বিষয়ে ব্লগ লেখা হতে পারে।",
		short_description: `<p>ইসলামের সমাজ ও শিক্ষা" একটি গুরুত্বপূর্ণ বিষয়, যা ইসলামের সামাজিক ও শিক্ষাগত দিক নিয়ে বিস্তারিত আলোচনা করে। </p>`,
		description: `<p>ইসলামের সমাজ ও শিক্ষা" একটি গুরুত্বপূর্ণ বিষয়, যা ইসলামের সামাজিক ও শিক্ষাগত দিক নিয়ে বিস্তারিত আলোচনা করে। এটি বিভিন্ন বিষয়ে ইসলামী ধারাবাহিকতা, নৈতিকতা, মৌলিক মূলতত্ত্ব, মানবিক বিকাশ ও সমাজের বিভিন্ন স্তর নিয়ে আলোচনা করে।

		ইসলামের সমাজ ও শিক্ষা নিয়ে লেখা হতে পারে যে ভাবে ইসলাম একটি পূর্ণাঙ্গ সামাজিক পদ্ধতি এবং মানবিক পরিবর্তন প্রতিষ্ঠান করে। ইসলাম মানুষের মধ্যে সমাজতান্ত্রিকতা, সমানতা, সহিষ্ণুতা, সহযোগিতা ও ন্যায়ের মূল আদর্শ নিয়ে আলোচনা করে।
		
		ইসলামের সমাজ ও শিক্ষা নিয়ে লেখা হতে পারে যে ভাবে ইসলাম শিক্ষার প্রতিটি দিকে প্রভাব ফেলে, এবং কীভাবে এটি ব্যক্তির নৈতিক ও ধারাবাহিক জীবনের স্তর বাড়াতে সাহায্য করে। ইসলামের প্রযোজনীয় শিক্ষাগত পদ্ধতি ও উদ্দেশ্যের উপর ভিত্তি করে, ব্যক্তিগত ও সামাজিক বিকাশের পথে মানবতার উন্নতির জন্য প্রেরণা দেয়।
		
		এছাড়াও, ইসলামের সমাজ ও শিক্ষা নিয়ে লেখা হতে পারে যে ভাবে ইসলাম মানুষের মধ্যে শান্তি, সহিষ্ণুতা, সমানতা, সহযোগিতা এবং সত্যের প্রতি আদর উপদেশ দেয়। ইসলামের মূল শিক্ষার উপর নির্ভর করে, একটি সম্পূর্ণ ও সম্মানজনক সমাজ গড়ে তোলার জন্য ব্যাপক ভাবে ইসলামের শিক্ষাগত অনুসরণ অনুশীলন করা হয়।</p>`,
		photo: "uploads/posts/is5.jpg",
		photo_alt_text: "ইসলামের সমাজ ও শিক্ষা",
		seo_title: "ইসলামের সমাজ ও শিক্ষা",
		seo_keyword: "ইসলামের সমাজ ও শিক্ষা",
		seo_description: "ইসলামের সমাজ ও শিক্ষা",
		seo_schema_tags: "ইসলামের সমাজ ও শিক্ষা",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba3'],
		comments:[],
		status: true,
	},
	{
		title: "ইসলামী রোজার প্রভাব ও ফজিলত",
		subtitle: "ইসলামী রোজা নিয়ে আলোচনা করা এবং রোজার ফজিলত সম্পর্কে লেখা হতে পারে।",
		short_description: `<p>ইসলামী রোজা" একটি মানবিক অবস্থা যা ইসলামের একটি গুরুত্বপূর্ণ ধর্মীয় ব্যবস্থা। এটি মাসহারার একটি মানবিক অবস্থা, যা ইসলামী ধর্মের মধ্যে অবদান ও প্রভাব প্রদর্শন করে।</p>`,
		description: `<p>ইসলামী রোজা" একটি মানবিক অবস্থা যা ইসলামের একটি গুরুত্বপূর্ণ ধর্মীয় ব্যবস্থা। এটি মাসহারার একটি মানবিক অবস্থা, যা ইসলামী ধর্মের মধ্যে অবদান ও প্রভাব প্রদর্শন করে।

		ইসলামী রোজার প্রভাব ও ফজিলত নিয়ে লেখা হতে পারে যে ভাবে রোজা মানুষের মধ্যে শান্তি, সহিষ্ণুতা, সমানতা, সহযোগিতা এবং নৈতিক বিকাশের মূল আদর্শ প্রতিষ্ঠা করে। রোজা একটি মানবিক অবস্থা, যা ব্যক্তিগত ও ধর্মীয় উন্নতির জন্য মানুষের মধ্যে নতুন দিক প্রদর্শন করে।
		
		ইসলামী রোজা নিয়ে লেখা হতে পারে যে ভাবে রোজা মানুষের অন্তর্নিহিত নৈতিকতা এবং ধারাবাহিকতা উন্নতি করে, এবং ইচ্ছাশক্তি, সহনশীলতা এবং দৈনন্দিন জীবনের সংগঠনে সাহায্য করে। এটি মানুষের চরিত্র উন্নতি, ধার্মিক প্রবৃত্তির বৃদ্ধি এবং অন্যান্য ভালো গুণের অনুসরণে সাহায্য করে।
		
		এছাড়াও, ইসলামী রোজার ফজিলত নিয়ে লেখা হতে পারে যে ভাবে রোজা ব্যক্তিগত ও ধর্মীয় উন্নতির মাধ্যমে মানুষের জীবনে সকল সুখ-দুঃখের মধ্যে শান্তি ও সমতা প্রদান করে। এটি মানুষের মানবিক পরিবর্তনে সাহায্য করে এবং একটি নিয়মিত রোজার মাধ্যমে আত্মনির্ভরশীলতা ও দুর্বলতা থেকে মুক্তি দেয়।</p>`,
		photo: "uploads/posts/is4.jpg",
		photo_alt_text: "রোজার প্রভাব ও ফজিলত",
		seo_title: "রোজার প্রভাব ও ফজিলত",
		seo_keyword: "রোজার প্রভাব ও ফজিলত",
		seo_description: "রোজার প্রভাব ও ফজিলত",
		seo_schema_tags: "রোজার প্রভাব ও ফজিলত",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba3'],
		comments:[],
		status: true,
	},
	{
		title: "ইসলামিক ইতিহাস ও ঐতিহ্য",
		subtitle: "ইসলামিক ইতিহাস, নবীদের জীবন কাহিনী এবং ইসলামিক ঐতিহ্য নিয়ে ব্লগ লেখা হতে পারে।",
		short_description: `<p>ইসলামিক ইতিহাস ও ঐতিহ্য" একটি অগ্রাধিকার বিষয়, যা ইসলামী ধর্মের বিকাশ, ইতিহাস, সংস্কৃতি, এবং ঐতিহ্য নিয়ে আলোচনা করে। ।</p>`,
		description: `<p>ইসলামিক ইতিহাস ও ঐতিহ্য" একটি অগ্রাধিকার বিষয়, যা ইসলামী ধর্মের বিকাশ, ইতিহাস, সংস্কৃতি, এবং ঐতিহ্য নিয়ে আলোচনা করে। এটি ইসলামী বিশ্বের মূল ঘটনা, ধর্মীয় ব্যবস্থা, বিভিন্ন ধর্মীয় ও সামাজিক পরম্পরা, ইতিহাস, ও ধারাবাহিক উৎসব নিয়ে আলোচনা করে।

		ইসলামিক ইতিহাস ও ঐতিহ্য বিষয়ে লেখা হতে পারে যে ভাবে ইসলাম আসল ধর্মের উৎপত্তি হয়েছিল এবং তার প্রতিষ্ঠান কিভাবে ঘটে। এটি সম্প্রদায়ের বিকাশ, ধর্মীয় ও সামাজিক বিপ্লব, ধারাবাহিক অনুষ্ঠান, ও বিভিন্ন ঐতিহ্যিক বিশেষতা নিয়ে আলোচনা করে।
		
		ইসলামিক ইতিহাস ও ঐতিহ্য নিয়ে লেখা হতে পারে যে ভাবে ইসলামিক বিশ্ব ধর্মীয় ও সামাজিক বিকাশের একটি মাধ্যম হয়েছে, যা বিভিন্ন ধর্মীয় সংস্কৃতি, ধারাবাহিক পরম্পরা, ও ঐতিহ্যের প্রভাবে বিস্তারিত হয়েছে।
		
		এছাড়াও, ইসলামিক ইতিহাস ও ঐতিহ্য নিয়ে লেখা হতে পারে যে ভাবে ইসলামী সমাজের সামাজিক ও ধারাবাহিক অবস্থা পরিবর্তন এবং উন্নতি হয়েছে এবং সেই প্রক্রিয়াতে ইসলামিক বিশ্ব আজকের রূপ নেয়। এটি ইসলামিক বিশ্বের ঐতিহাসিক এবং সাংস্কৃতিক বৃহত্তর পরিসরের বিভিন্ন বিষয়ে জ্ঞান ও বুদ্ধিমত্তার দৃষ্টিভঙ্গি প্রদর্শন করে।</p>`,
		photo: "uploads/posts/is3.jpg",
		photo_alt_text: "ইসলামিক ইতিহাস ও ঐতিহ্য",
		seo_title: "ইসলামিক ইতিহাস ও ঐতিহ্য",
		seo_keyword: "ইসলামিক ইতিহাস ও ঐতিহ্য",
		seo_description: "ইসলামিক ইতিহাস ও ঐতিহ্য",
		seo_schema_tags: "ইসলামিক ইতিহাস ও ঐতিহ্য",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba3'],
		comments:[],
		status: true,
	},
	{
		title: "ইসলামের প্রতিষ্ঠান ও অর্থনীতি",
		subtitle: " ইসলামী প্রতিষ্ঠান, প্রতিষ্ঠানের কাজ এবং অর্থনৈতিক প্রশাসনের বিষয়ে ব্লগ লেখা হতে পারে।",
		short_description: `<p>ইসলামের প্রতিষ্ঠান ও অর্থনীতি" একটি গুরুত্বপূর্ণ বিষয়, যা ইসলামিক ধর্মের অর্থনৈতিক মূলতত্ত্ব এবং অর্থনীতির বিভিন্ন দিক নিয়ে আলোচনা করে।</p>`,
		description: `<p>ইসলামের প্রতিষ্ঠান ও অর্থনীতি" একটি গুরুত্বপূর্ণ বিষয়, যা ইসলামিক ধর্মের অর্থনৈতিক মূলতত্ত্ব এবং অর্থনীতির বিভিন্ন দিক নিয়ে আলোচনা করে। এটি ইসলামিক ধর্মের ব্যবস্থা, মূলস্থান, অর্থনীতির উদ্দেশ্য, এবং মানবিক বিকাশের প্রক্রিয়া সম্পর্কে বিস্তারিত করে।

		ইসলামের প্রতিষ্ঠান ও অর্থনীতি নিয়ে লেখা হতে পারে যে ভাবে ইসলাম একটি ব্যবস্থাত্মক ও সমাজতান্ত্রিক বিশ্বাস প্রতিষ্ঠা করে। এটি সামাজিক ন্যায়, সমানতা, সহিষ্ণুতা এবং ব্যবস্থাপনা নিয়ে আলোচনা করে এবং মানবিক উন্নতির পথ নির্ধারণ করে।
		
		ইসলামের প্রতিষ্ঠান ও অর্থনীতি নিয়ে লেখা হতে পারে যে ভাবে ইসলাম অর্থনৈতিক ব্যবস্থা নির্ধারণ করে এবং সামাজিক অর্থনৈতিক সংস্কৃতি ও ব্যবস্থা নির্মাণ করে। ইসলাম অর্থনীতিতে মানবিক মূল্যায়ন, সম্মান, ন্যায় ও সমানতা নিয়ে জোর দেয় এবং সামাজিক ও অর্থনৈতিক সমৃদ্ধির প্রতি মানব উন্নতির ধারাবাহিক প্রবৃদ্ধির পথ প্রদর্শন করে।
		
		এছাড়াও, ইসলামের প্রতিষ্ঠান ও অর্থনীতি নিয়ে লেখা হতে পারে যে ভাবে ইসলাম ধারাবাহিক ও অর্থনৈতিক নীতিমালা, সামাজিক ও প্রশাসনিক বিন্যাস, এবং ব্যবস্থাপনা ব্যবস্থা তৈরি করে। এটি মানব সমাজের বিভিন্ন স্তরে অর্থনৈতিক ও সামাজিক সুযোগ প্রদান করে এবং মানুষের জীবনে সামাজিক ও অর্থনৈতিক সমৃদ্ধির সৃষ্টি করে।</p>`,
		photo: "uploads/posts/is2.jpg",
		photo_alt_text: "ইসলামের প্রতিষ্ঠান ও অর্থনীতি",
		seo_title: "ইসলামের প্রতিষ্ঠান ও অর্থনীতি",
		seo_keyword: "ইসলামের প্রতিষ্ঠান ও অর্থনীতি",
		seo_description: "ইসলামের প্রতিষ্ঠান ও অর্থনীতি",
		seo_schema_tags: "ইসলামের প্রতিষ্ঠান ও অর্থনীতি",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba3'],
		comments:[],
		status: true,
	},
	{
		title: "ইসলাম ও ভিন্ন ধর্মের সম্পর্ক",
		subtitle: "ইসলাম ও অন্যান্য ধর্মের সম্পর্ক, সাম্প্রদায়িক সম্প্রীতি এবং পরস্পরের সহানুভূতি নিয়ে লেখা হতে পারে।",
		short_description: `<p>ইসলাম ও ভিন্ন ধর্মের সম্পর্ক" একটি গুরুত্বপূর্ণ বিষয়, যা ইসলাম ধর্ম এবং অন্যান্য বিভিন্ন ধর্মের সম্পর্ক নিয়ে আলোচনা করে। </p>`,
		description: `<p>ইসলাম ও ভিন্ন ধর্মের সম্পর্ক" একটি গুরুত্বপূর্ণ বিষয়, যা ইসলাম ধর্ম এবং অন্যান্য বিভিন্ন ধর্মের সম্পর্ক নিয়ে আলোচনা করে। এটি মানুষের ধর্মীয় সাংস্কৃতিক বিভিন্নতা, মতাবলম্বনার প্রতি সম্মান এবং ধর্মীয় মূল্যায়ন নিয়ে আলোচনা করে।

		ইসলাম ও ভিন্ন ধর্মের সম্পর্ক নিয়ে লেখা হতে পারে যে ভাবে ইসলাম একটি প্রবল ধর্ম হিসেবে বিভিন্ন ধর্মের সাথে সহজেই অনুসরণ করা যায়। ইসলাম ধর্মে সম্মান, সহিষ্ণুতা, এবং সামান্যতা গুরুত্ব দেওয়া হয় এবং অন্যান্য ধর্মের সাথে সাংস্কৃতিক ও ধারাবাহিক মিল রয়েছে।
		
		ইসলাম ও ভিন্ন ধর্মের সম্পর্ক নিয়ে লেখা হতে পারে যে ভাবে ইসলাম এবং অন্যান্য ধর্মের মধ্যে সাহায্য এবং সহানুভূতি নিয়ে আলোচনা করা হয়। ধর্মীয় সম্প্রদায়ের মধ্যে সামান্যতা, মানবিকতা, ও সহিষ্ণুতা একটি গুরুত্বপূর্ণ বিষয় হয় এবং ইসলাম অন্য ধর্মের সাথে এই সাম্যের মাধ্যমে মিলে যায়।
		
		এছাড়াও, ইসলাম ও ভিন্ন ধর্মের সম্পর্ক নিয়ে লেখা হতে পারে যে ভাবে ধর্মীয় সহিষ্ণুতা, সহনীয়তা এবং বিভিন্ন ধর্মের মধ্যে সাম্প্রদায়িক একতা বাড়ায়। এটি মানবিক সম্প্রদায়ের অনুসন্ধানে সাহায্য করে এবং মানবিক পরম্পরাগতি ও ধর্মীয় সম্প্রদায়ের মধ্যে সহযোগিতা এবং সহমর্মিতা বাড়ায়।</p>`,
		photo: "uploads/posts/is1.jpg",
		photo_alt_text: "ইসলাম ও ভিন্ন ধর্মের সম্পর্ক",
		seo_title: "ইসলাম ও ভিন্ন ধর্মের সম্পর্ক",
		seo_keyword: "ইসলাম ও ভিন্ন ধর্মের সম্পর্ক",
		seo_description: "ইসলাম ও ভিন্ন ধর্মের সম্পর্ক",
		seo_schema_tags: "ইসলাম ও ভিন্ন ধর্মের সম্পর্ক",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67ba3'],
		comments:[],
		status: true,
	},

	// বই পর্যালোচনা

	{
		title: "বিপদ যখন নিয়ামাত",
		subtitle: " বিপদ যখন নিয়ামাত",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। </p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "uploads/posts/b7.png",
		photo_alt_text: "বিপদ যখন নিয়ামাত",
		seo_title: "বিপদ যখন নিয়ামাত",
		seo_keyword: "বিপদ যখন নিয়ামাত",
		seo_description: "বিপদ যখন নিয়ামাত",
		seo_schema_tags: "বিপদ যখন নিয়ামাত",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb3'],
		comments:[],
		status: true,

	},
	{
		title: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		subtitle: " আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "uploads/posts/b8.jpg",
		photo_alt_text: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		seo_title: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		seo_keyword: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		seo_description: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		seo_schema_tags: "আইনে রাসূল (ছাঃ) দো’আ অধ্যায়",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb3'],
		comments:[],
		status: true,

	},
	{
		title: "আর রাহীকুল মাখতূম",
		subtitle: "আর রাহীকুল মাখতূম",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "uploads/posts/b9.jpg",
		photo_alt_text: "আর রাহীকুল মাখতূম",
		seo_title: "আর রাহীকুল মাখতূম",
		seo_keyword: "আর রাহীকুল মাখতূম",
		seo_description: "আর রাহীকুল মাখতূম",
		seo_schema_tags: "আর রাহীকুল মাখতূম",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb3'],
		comments:[],
		status: true,

	},
	{
		title: "স্মার্ট প্যারেন্টিং উইথ মুহাম্মাদ (সঃ)",
		subtitle: "স্মার্ট প্যারেন্টিং উইথ মুহাম্মাদ (সঃ)",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "uploads/posts/b3.jpg",
		photo_alt_text: "স্মার্ট প্যারেন্টিং",
		seo_title: "স্মার্ট প্যারেন্টিং",
		seo_keyword: "স্মার্ট প্যারেন্টিং",
		seo_description: "স্মার্ট প্যারেন্টিং",
		seo_schema_tags: "স্মার্ট প্যারেন্টিং",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb3'],
		comments:[],
		status: true,

	},
	{
		title: "খুশু-খুযু",
		subtitle: "নামাজের খুশু-খুযু",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "uploads/posts/b5.jpg",
		photo_alt_text: "খুশু-খুযু",
		seo_title: "খুশু-খুযু",
		seo_keyword: "খুশু-খুযু",
		seo_description: "খুশু-খুযু",
		seo_schema_tags: "খুশু-খুযু",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb3'],
		comments:[],
		status: true,

	},
	{
		title: "হালাল বিনোদন",
		subtitle: "হালাল বিনোদন",
		short_description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে।</p>`,
		description: `<p>মুসলিম উম্মাহ বর্তমান সময়ের মতো ঝঞ্ঝাবিক্ষুব্ধ সময় আগে কখনও কাটায়নি। একের-পর-এক বিপদের মধ্য দিয়ে আমাদের দিনমান অতিবাহিত হচ্ছে। দুর্দশাগ্রস্ত মানুষের আর্তচিৎকারে আকাশ-বাতাস ভারী হয়ে আসছে। পুরো বিশ্বেই এই উম্মাহর সদস্যরা বিপদের ঘোর অমানিশায় দিন কাটাচ্ছে। এ ঘোর অমানিশা কাটিয়ে সাফল্যের সূর্যোদয় তখনই হবে, যখন আমরা সেই বিপদরূপী অন্ধকারের স্বরূপ অনুধাবন করতে পারব। জানতে পারব আমাদের করণীয় পদক্ষেপ সম্পর্কে। “বিপদ যখন নিয়ামাত” বইতে সংক্ষিপ্ত পরিসরে সেই অন্ধকার কাটানোর জন্যে প্রয়োজনীয় কিছু দিকনির্দেশনা দেওয়া হয়েছে। দেওয়া হয়েছে কিছু গুরুত্বপূর্ণ নাসীহা, যাতে আমরা কঠিনতম বিপদের মুহূর্তেও অবিচল থাকতে পারি। আল্লাহর ওপর তাওয়াক্কুল করে সঠিক পদক্ষেপ গ্রহণের মধ্যমে ছিনিয়ে আনতে পারি সাফল্যের লাল সূর্য।</p>`,
		photo: "uploads/posts/b6.jpg",
		photo_alt_text: "হালাল বিনোদন",
		seo_title: "হালাল বিনোদন",
		seo_keyword: "হালাল বিনোদন",
		seo_description: "হালাল বিনোদন",
		seo_schema_tags: "হালাল বিনোদন",
		published_date: "2023-07-05",
		categories: ['65769b274825174d9fd67bb3'],
		comments:[],
		status: true,

	},

];

const run = async () => mongoose.connect(db_url)
	.then(async () => {
		console.log("\n");
		console.log("blogs seeding");

		function convertToSlug(Text) {
			return Text.replace(/[`~!@#$%^&*()_\-+=\[\]{};:'"\\|\/,.<>?\s]/g, ' ').replace(/^\s+|\s+$/gm,'').replace(/\s+/g, '-');
		}

		await Model.deleteMany({});
		for (let i = 0; i < data.length; i++) {
			let item = data[i]
			item.url = convertToSlug(item.title)
			// item.categories = await getId()
			await Model.create(item);
		}

		// let response = await Model.insertMany(data);

		console.log("blogs seeding complete");

		console.log("\n");
	});

// run()
module.exports = async () => run()
