const { default: mongoose, Schema } = require("mongoose");
const { db_url } = require("../../../../../configs/db.config");
const Model = require("../model/model");

let data = [
	
	{
		title: "আলিফ সাগির",
		ratings: "3",
		sub_title: "ওয়েব ডেভেলোপার",
		description: "আগামীকাল সোমবার (২১ জুন) রাজধানীর তিনটি হাসপাতালে ফাইজার-বায়োএনটেকের করোনা টিকা প্রদান কার্যক্রম শুরু হবে। প্রাথমিকভাবে বঙ্গবন্ধু শেখ মুজিব মেডিকেল বিশ্ববিদ্যালয়।",
	},
	{
		title: "মোঃ তারেক",
		ratings: "3",
		sub_title: "ওয়েব ডেভেলোপার",
		description: "আগামীকাল সোমবার (২১ জুন) রাজধানীর তিনটি হাসপাতালে ফাইজার-বায়োএনটেকের করোনা টিকা প্রদান কার্যক্রম শুরু হবে। প্রাথমিকভাবে বঙ্গবন্ধু শেখ মুজিব মেডিকেল বিশ্ববিদ্যালয়।",
	},
	{
		title: "মোঃ সাজিদ",
		ratings: "3",
		sub_title: "ওয়েব ডেভেলোপার",
		description: "আগামীকাল সোমবার (২১ জুন) রাজধানীর তিনটি হাসপাতালে ফাইজার-বায়োএনটেকের করোনা টিকা প্রদান কার্যক্রম শুরু হবে। প্রাথমিকভাবে বঙ্গবন্ধু শেখ মুজিব মেডিকেল বিশ্ববিদ্যালয়।",
	},
	{
		title: "মোঃ এহসান",
		ratings: "3",
		sub_title: "ওয়েব ডেভেলোপার",
		description: "আগামীকাল সোমবার (২১ জুন) রাজধানীর তিনটি হাসপাতালে ফাইজার-বায়োএনটেকের করোনা টিকা প্রদান কার্যক্রম শুরু হবে। প্রাথমিকভাবে বঙ্গবন্ধু শেখ মুজিব মেডিকেল বিশ্ববিদ্যালয়।",
	},
	{
		title: "মাহবুব হাসান",
		ratings: "3",
		sub_title: "ওয়েব ডেভেলোপার",
		description: "আগামীকাল সোমবার (২১ জুন) রাজধানীর তিনটি হাসপাতালে ফাইজার-বায়োএনটেকের করোনা টিকা প্রদান কার্যক্রম শুরু হবে। প্রাথমিকভাবে বঙ্গবন্ধু শেখ মুজিব মেডিকেল বিশ্ববিদ্যালয়।",
	},
	{
		title: "মোঃ আরিফ",
		ratings: "3",
		sub_title: "রাজধানীর তিনটি হাসপাতালে ",
		description: "আগামীকাল সোমবার (২১ জুন) রাজধানীর তিনটি হাসপাতালে ফাইজার-বায়োএনটেকের করোনা টিকা প্রদান কার্যক্রম শুরু হবে। প্রাথমিকভাবে বঙ্গবন্ধু শেখ মুজিব মেডিকেল বিশ্ববিদ্যালয়।",
	},
	
];

module.exports = async () => mongoose.connect(db_url)
	.then(async () => {
		console.log("\n");
		console.log("user review seeding");

		await Model.deleteMany({});
		for (let i = 0; i < data.length; i++) {
			await Model.create(data[i]);
		}

		// let response = await Model.insertMany(data);

		console.log("user review seeding complete");

		console.log("\n");
	});
