const { default: mongoose, Schema } = require("mongoose");
const { db_url } = require("../../../../../configs/db.config");
const Model = require("../model/model");

let data = [
	
	{
		title: "ইসলাম",
		short_description:"ইসলাম হলো একটি ধর্ম যা মুসলিমদের বিশ্বাস এবং অনুসরণ করার জন্য নির্ধারিত হয়েছে। এটি মুসলিমদের জীবনযাপনের নির্দেশিকা সরবরাহ করে এবং একটি সম্পূর্ণ জীবনযাপনের প্রতি অত্যন্ত গুরুত্ব দেয়।",
		long_description:"ইসলাম হলো একটি ধর্ম যা মুসলিমদের বিশ্বাস এবং অনুসরণ করার জন্য নির্ধারিত হয়েছে। এটি মুসলিমদের জীবনযাপনের নির্দেশিকা সরবরাহ করে এবং একটি সম্পূর্ণ জীবনযাপনের প্রতি অত্যন্ত গুরুত্ব দেয়।ইসলামের মৌলিক অংশ হলো একতা ও আল্লাহর অমীমাংসিত শক্তির বিশ্বাস। মুসলিমদের প্রাথমিক নৈতিক দলিলগুলি কুরআনে এবং হাদিসে প্রদর্শিত হয়। ইসলামের মূল আদর্শ সম্পর্কে বিস্তারিত ধারণা পেতে, মুসলিম সমাজ সাধারণত পঞ্চ পিল্লার (ইসলামের পাঁচটি মূল শ্রেণীবিন্যাস) এবং সুন্নাহের (প্রফেত মোহাম্মদ (সা:) অনুসরণের নির্দেশিকা) মাধ্যমে জীবনযাপন করে।",
		photo:"",
		seo_title:"ইসলাম",
		seo_keyword:"ইসলাম",
		seo_description:"ইসলাম",
		url: "/blog-islam",
		status: true,
	},
	{
		title: "ইসলামী আন্দোলন",
		short_description:"ইসলামের ধর্মীয় অনুষ্ঠান, শ্রাদ্ধ, নৈতিক মূল্য, মুসলিম সমাজের সংগঠন, শিক্ষা এবং মানবিক উন্নয়নের ক্ষেত্রে বিভিন্ন ধরনের বিধান ও নির্দেশিকা ইসলামে বিবরণ করে।",
		long_description:"ইসলামের ধর্মীয় অনুষ্ঠান, শ্রাদ্ধ, নৈতিক মূল্য, মুসলিম সমাজের সংগঠন, শিক্ষা এবং মানবিক উন্নয়নের ক্ষেত্রে বিভিন্ন ধরনের বিধান ও নির্দেশিকা ইসলামে বিবরণ করে। এছাড়াও, ইসলামে মানবিকতার গুরুত্ব অনেক জনপ্রিয়। ইসলামে দান, মানবিক সহানুভূতি, ন্যায় এবং শান্তি ইত্যাদি মানবিক মৌলিক অধিকার ও মানবিক মূল্যের প্রতি অগ্রহণ করা হয়।",
		photo:"",
		seo_title:"ইসলামী আন্দোলন",
		seo_keyword:"ইসলামী আন্দোলন",
		seo_description:"ইসলামী আন্দোলন",
		url: "/blog-islamic-movement",
		status: true,
	},
	{
		title: "বাংলাদেশ",
		short_description:"বাংলাদেশ হলো একটি দক্ষিণ এশিয়ার দেশ, যা দক্ষিণে ভারতের পশ্চিমে ও উত্তরে ভারতের অসম রাজ্যের সীমান্তে অবস্থিত।",
		long_description:"বাংলাদেশ হলো একটি দক্ষিণ এশিয়ার দেশ, যা দক্ষিণে ভারতের পশ্চিমে ও উত্তরে ভারতের অসম রাজ্যের সীমান্তে অবস্থিত। এটি বাংলা ভাষায় প্রধান ভাষা ও সংস্কৃতির নিত্যনতুন বাসভাব। বাংলাদেশ একটি সাংবিধানিকভাবে গণপ্রজাতন্ত্রিক প্রজাতন্ত্র। রাষ্ট্রের রাজধানী এবং বৃহত্তম শহর হলো ঢাকা।",
		photo:"",
		seo_title:"বাংলাদেশ",
		seo_keyword:"বাংলাদেশ",
		seo_description:"বাংলাদেশ",
		url: "/blog-bangladesh",
		status: true,
	},
	{
		title: "রাজনীতি",
		short_description:"রাজনীতি হলো সমাজের বিভিন্ন স্তরে শাসন, কর্তৃত্ব, ও শক্তি বিতরণের প্রক্রিয়া ও কৌশল। এটি সমাজের বিভিন্ন সদস্যদের মধ্যে সমঞ্জস্যা ও সংঘাতের মাধ্যমে সরকার",
		long_description:"রাজনীতি হলো সমাজের বিভিন্ন স্তরে শাসন, কর্তৃত্ব, ও শক্তি বিতরণের প্রক্রিয়া ও কৌশল। এটি সমাজের বিভিন্ন সদস্যদের মধ্যে সমঞ্জস্যা ও সংঘাতের মাধ্যমে সরকাররাজনীতি বিভিন্ন ধর্ম, রাষ্ট্র, সমাজ ও সাংস্কৃতিতে পার্থক্য দেখায়। এটি একটি বিশাল শ্রেণীর বিষয়, যা নাগরিকদের স্বাধীনতা, অধিকার, দায়িত্ব, ও সরকারি নির্ণয়ের সাথে সংযুক্ত।",
		photo:"",
		seo_title:"রাজনীতি",
		seo_keyword:"রাজনীতি",
		seo_description:"রাজনীতি",
		url: "/blog-politics",
		status: true,
	},
	{
		title: "ইতিহাস",
		short_description:"ইতিহাস হলো মানব সভ্যতা ও সমাজের ঘটনাবলীর অধ্যয়ন এবং অধ্যয়নের বিষয়ে একটি শাখা। ",
		long_description:"ইতিহাস হলো মানব সভ্যতা ও সমাজের ঘটনাবলীর অধ্যয়ন এবং অধ্যয়নের বিষয়ে একটি শাখা। এটি নানা ঘটনা, ব্যক্তিত্ব, সমাজ, রাজনীতি, অর্থনীতি, সাংস্কৃতিক অবস্থা, ও বিশেষতঃ ঘটনার পরিস্থিতি নিয়ে তথ্য সংগ্রহ করে।",
		photo:"",
		seo_title:"ইতিহাস",
		seo_keyword:"ইতিহাস",
		seo_description:"ইতিহাস",
		url: "/blog-history",
		status: true,
	},
	{
		title: "সংবাদ",
		short_description:"বর্তমান সময়ে বাংলাদেশের অর্থনৈতিক, রাজনৈতিক, সামাজিক এবং পরিবেশ সংক্রান্ত বিভিন্ন দিক উল্লেখযোগ্য রয়েছে।",
		long_description:"অর্থনৈতিক দিকে বাংলাদেশ বর্তমানে প্রশাসনিক ও বাণিজ্যিক ক্ষেত্রে দ্রুত উন্নয়নের পথে অগ্রসর হচ্ছে। বাণিজ্যিক ক্ষেত্রে গারমেন্ট ও নৌ উদ্যোগরাজনৈতিকভাবে, বাংলাদেশ বিভিন্ন রাজনৈতিক পরিস্থিতির মধ্যে অংশীদার হয়ে থাকে, যেমন নিরাপত্তা, রাষ্ট্রীয় ও আন্তর্জাতিক নীতি ইত্যাদি। দেশে সময়ের সাথে সাথে পরিবর্তন ঘটছে রাজনৈতিক দলের নীতিমালা, যা সমাজের গতি ও প্রতিস্থাপন প্রভাবিত করছে।",
		photo:"",
		seo_title:"সংবাদ",
		seo_keyword:"সংবাদ",
		seo_description:"সংবাদ",
		url: "/news",
		status: true,
	},
	{
		title: "ইউনিয়ন পরিষদ",
		short_description:"বর্তমান সময়ে বাংলাদেশের অর্থনৈতিক, রাজনৈতিক, সামাজিক এবং পরিবেশ সংক্রান্ত বিভিন্ন দিক উল্লেখযোগ্য রয়েছে।",
		long_description:"অর্থনৈতিক দিকে বাংলাদেশ বর্তমানে প্রশাসনিক ও বাণিজ্যিক ক্ষেত্রে দ্রুত উন্নয়নের পথে অগ্রসর হচ্ছে। বাণিজ্যিক ক্ষেত্রে গারমেন্ট ও নৌ উদ্যোগরাজনৈতিকভাবে, বাংলাদেশ বিভিন্ন রাজনৈতিক পরিস্থিতির মধ্যে অংশীদার হয়ে থাকে, যেমন নিরাপত্তা, রাষ্ট্রীয় ও আন্তর্জাতিক নীতি ইত্যাদি। দেশে সময়ের সাথে সাথে পরিবর্তন ঘটছে রাজনৈতিক দলের নীতিমালা, যা সমাজের গতি ও প্রতিস্থাপন প্রভাবিত করছে।",
		photo:"",
		seo_title:"ইউনিয়ন পরিষদ",
		seo_keyword:"ইউনিয়ন পরিষদ",
		seo_description:"ইউনিয়ন পরিষদ",
		related_categories: ['65618a3394f36f64bfe54d46','65618a3394f36f64bfe54d46'],
		url: "/news",
		status: true,
	},
	{
		title: "সামাজিক কাজ",
		short_description:"সামাজিক কর্ম হলো একটি মানবিক কাজ যা মানুষের সাহায্য করার মাধ্যমে সমাজের উন্নতি ও সমৃদ্ধির দিকে অগ্রসর হতে সাহায্য করে।",
		long_description:"সামাজিক কর্ম হলো একটি মানবিক কাজ যা মানুষের সাহায্য করার মাধ্যমে সমাজের উন্নতি ও সমৃদ্ধির দিকে অগ্রসর হতে সাহায্য করে। এটি মানবিক দৃষ্টিকোণ থেকে গরিব, দুর্বল, প্রতিবন্ধী, প্রয়াত, অসুস্থ, শিশু-বাল, বৃদ্ধ, প্রতিবন্ধী, যারা সমাজের অবস্থান অনুযায়ী সাহায্যের প্রয়োজন রাখেন তাদের জন্য কাজ করে।সামাজিক কর্মীরা সমাজের বিভিন্ন সেবা ক্ষেত্রে কাজ করে যেমন: শিক্ষা, স্বাস্থ্য সেবা, গরীব ও দুর্বল মানুষের জন্য খাদ্য ও নিরাপত্তা সরবরাহ, অসুস্থ মানুষদের চিকিৎসা সেবা প্রদান, সমাজের জনগণের মধ্যে সচেতনতা বাড়ানো, সমাজের অসন্তোষের মূল কারণ বুঝে তা সমাধান করা, দুর্ঘটনা ও আপাততা সন্নিবেশিত মানুষদের জন্য সাহায্য ও সহায়তা প্রদান ইত্যাদি।",
		photo:"",
		seo_title:"সামাজিক কাজ",
		seo_keyword:"সামাজিক কাজ",
		seo_description:"সামাজিক কাজ",
		related_categories: ['65618a3394f36f64bfe54d46','65618a3394f36f64bfe54d46'],
		url: "/social-work",
		status: true,
	},
	{
		title: "বই পর্যালোচনা",
		short_description:"বই রিভিউ হল একটি লেখার ধরণ যা একটি বইর বিষয়ে পর্যালোচনা ও মতামত প্রকাশ করে।",
		long_description:"বই রিভিউ হল একটি লেখার ধরণ যা একটি বইর বিষয়ে পর্যালোচনা ও মতামত প্রকাশ করে। এটি বইটির বিষয়, লেখকের শৈলী, কাহিনীর কেন্দ্রীয় ধারাবাহিকতা, চরিত্র স্থাপন, লেখা সৃষ্টিতে ব্যবহৃত ভাষা ও কাহিনীর গুরুত্বপূর্ণ বিষয় সম্পর্কে পর্যালোচনা করে।একটি বই রিভিউ বানানোর সময়ে রিভিউয়ার তার বিচার ও মতামত প্রদানের জন্য বিশদভাবে বইটি পড়ে তার প্রতিভাগ্য অংশ, সৃষ্টিতে ব্যবহৃত ভাষার গুণগত মান এবং বইটির কাহিনীর কেন্দ্রীয় ধারাবাহিকতা নিয়ে আলোচনা করে। এছাড়াও, রিভিউয়ার পড়ার অনুভব ও তার মন্তব্যের মাধ্যমে পড়ার অনুভূতি সম্পর্কে ব্যাখ্যা করা হয়।",
		photo:"",
		seo_title:"বই পর্যালোচনা",
		seo_keyword:"বই পর্যালোচনা",
		seo_description:"বই পর্যালোচনা",
		url: "/book-review",
		status: true,
	},
	{
		title: "বিবিধ",
		short_description:"দৈনন্দিন বিষয়াবলী নিয়ে আলোচনা",
		long_description:"দৈনন্দিন বিষয়াবলী নিয়ে আলোচনা",
		photo:"",
		seo_title:"বিবিধ",
		seo_keyword:"বিবিধ",
		seo_description:"বিবিধ",
		url: "/blog-miscellaneous",
		status: true,
	},
];

module.exports = async () => mongoose.connect(db_url)
	.then(async () => {
		console.log("\n");
		console.log("blog categories seeding");

		await Model.deleteMany({});
		for (let i = 0; i < data.length; i++) {
			await Model.create(data[i]);
		}

		// let response = await Model.insertMany(data);

		console.log("blog categories seeding completeee");

		console.log("\n");
	});
