const { default: mongoose, Schema } = require("mongoose");
const { db_url } = require("../../../../../configs/db.config");
const Model = require("../model/model");
const contentCategoriesModel = require("../../content_categories/model/model")


var uni = [];
const gen_rand = () => {
	let rand = Math.floor(Math.random() * 5);
	if (rand == 0 || uni.includes(rand)) {
		rand = gen_rand();
	}
	uni.push(rand);
	return rand;
};

async function getId() {
	// Get a random entry
	var random = gen_rand();
	var data = await contentCategoriesModel.find().limit(1).skip(random);
	console.log(random, data[0]?._id);
	return data.map(i => i._id);
}

let data = [

	{
		title: "ক্রেডিট কার্ডের সমান প্লাস্টিক খাচ্ছে মানুষ",
		subtitle: "প্লাস্টিক দূষণের মাত্রা সারা বিশ্বেই বাড়ছে।",
		short_description: "`<p>১৯৫০ সাল থেকেই শিল্প খাতে প্লাস্টিকের ব্যবহার বাড়তে শুরু করেছে। বর্তমানে প্রতিবছর সারা বিশ্বে ৪০ কোটি টনের বেশি প্লাস্টিক উৎপাদন হচ্ছে,।</p>`",
		description: `<p>১৯৫০ সাল থেকেই শিল্প খাতে প্লাস্টিকের ব্যবহার বাড়তে শুরু করেছে। বর্তমানে প্রতিবছর সারা বিশ্বে ৪০ কোটি টনের বেশি প্লাস্টিক উৎপাদন হচ্ছে, যার মধ্যে প্রায় 8০ লাখ টন প্লাস্টিক সমুদ্রে ফেলে দেওয়া হয়।</p>`,
		photo: "",
		photo_alt_text: "প্লাস্টিক দূষণের",
		seo_title: "প্লাস্টিক দূষণের",
		seo_keyword: "প্লাস্টিক দূষণের",
		seo_description: "প্লাস্টিক দূষণের",
		seo_schema_tags: "প্লাস্টিক দূষণের",
		published_date: "2023-06-14",
		categories: [],
		status: true,

	},
	{
		title: "প্লাস্টিকের বোতলে তৈরি পরিবেশবান্ধব বাড়ি",
		subtitle: "প্লাস্টিকের বোতলে বালু ভর্তি করে সিমেন্ট দিয়ে পরিবেশবান্ধব এই বাড়ি তৈরি করে এলাকায় বেশ সাড়া ফেলেছেন শমসের আলী।",
		short_description: "`<p>শেরপুরে ফেলে দেওয়া কোমল পানীয়ের প্লাস্টিকের বোতল দিয়ে দৃষ্টিনন্দন বাড়ি তৈরি করেছেন এক গ্রাম্য কবিরাজ।</p>`",
		description: `<p>শেরপুরে ফেলে দেওয়া কোমল পানীয়ের প্লাস্টিকের বোতল দিয়ে দৃষ্টিনন্দন বাড়ি তৈরি করেছেন এক গ্রাম্য কবিরাজ। সদর উপজেলার বাজিতখিলা ইউনিয়নের সুলতানপুর উত্তরপাড়া গ্রামের এই কবিরাজের নাম মো. শমসের আলী (৬৫)। এলাকায় তিনি ফক্কা কবিরাজ নামে পরিচিত।</p>`,
		photo: "",
		photo_alt_text: " পরিবেশবান্ধব বাড়ি",
		seo_title: " পরিবেশবান্ধব বাড়ি",
		seo_keyword: " পরিবেশবান্ধব বাড়ি",
		seo_description: " পরিবেশবান্ধব বাড়ি",
		seo_schema_tags: " পরিবেশবান্ধব বাড়ি",
		published_date: "2023-06-14",
		categories: [],
		status: true,

	},
	{
		title: "স্কুলের বেতন প্লাস্টিকের বোতল",
		subtitle: "স্কুলের বেতন প্লাস্টিকের বোতল।",
		short_description: "`<p>দুই দশক আগের তুলনায় বিশ্বে এখন দ্বিগুণ প্লাস্টিক বর্জ্য তৈরি হচ্ছে এবং এর বেশির ভাগেরই শেষ ঠিকানা হয় মাটি।</p>`",
		description: `<p>তেমজেন ইমনা আলং নাগাল্যান্ডের পর্যটন ও উচ্চশিক্ষাবিষয়ক মন্ত্রী। তিনি সুবিধাবঞ্চিত শিশুদের জন্য অক্ষর ফাউন্ডেশনের তৈরি একটি শিক্ষাপ্রতিষ্ঠানের ভিডিও শেয়ার করেছেন। বিদ্যালয়টির অবস্থান আসামের রাজধানী গুয়াহাটির গোরচুক এলাকায়। এতে পড়াশোনার ফি হিসেবে শিক্ষার্থীদের কাছ থেকে প্লাস্টিকের বর্জ্য নেওয়া হয়। প্রতি সপ্তাহে একজন শিক্ষার্থীকে প্লাস্টিকের ২৫টি বোতল জমা দিতে হয়।</p>`,
		photo: "",
		photo_alt_text: "স্কুলের বেতন প্লাস্টিক",
		seo_title: "স্কুলের বেতন প্লাস্টিক",
		seo_keyword: "স্কুলের বেতন প্লাস্টিক",
		seo_description: "স্কুলের বেতন প্লাস্টিক",
		seo_schema_tags: "স্কুলের বেতন প্লাস্টিক",
		published_date: "2023-06-14",
		categories: [],
		status: true,

	},
	{
		title: "ডুবন্ত মানুষ বাঁচাবে কৃত্রিম বুদ্ধিমত্তাসম্পন্ন নৌযান",
		subtitle: "ডুবন্ত মানুষ বাঁচাবে কৃত্রিম বুদ্ধিমত্তাসম্পন্ন নৌযান!",
		short_description: "`<p>সমুদ্রে পড়ে গেলে জীবন বাঁচানো কঠিন। স্কটল্যান্ডে সামুদ্রিক নৌ দুর্ঘটনা এখন নিয়মিত ঘটনা। এ ধরনের দুর্ঘটনায় অনেকেই প্রাণ হারান। সমুদ্র এলাকায় মানুষের প্রাণ রক্ষায় তাই কৃত্রিম বুদ্ধিমত্তাসম্পন্ন নৌযান তৈরি করেছে স্কটিশ কোম্পানি জেলিম।</p>`",
		description: `<p>সমুদ্রে পড়ে গেলে জীবন বাঁচানো কঠিন। স্কটল্যান্ডে সামুদ্রিক নৌ দুর্ঘটনা এখন নিয়মিত ঘটনা। এ ধরনের দুর্ঘটনায় অনেকেই প্রাণ হারান। সমুদ্র এলাকায় মানুষের প্রাণ রক্ষায় তাই কৃত্রিম বুদ্ধিমত্তাসম্পন্ন নৌযান তৈরি করেছে স্কটিশ কোম্পানি জেলিম। প্রতিষ্ঠানটি এমন এক ধরনের জীবনরক্ষাকারী নৌযান তৈরি করেছে, যা স্বয়ংক্রিয়ভাবে কোনো ডুবন্ত মানুষকে রক্ষা করতে পারে। এ ছাড়া এ নৌযান চালাতে কোনো চালকের প্রয়োজন পড়ে না। প্রতিষ্ঠানটি তাদের এ নৌযানের নাম দিয়েছে ‘গার্ডিয়ান’।</p>`,
		photo: "",
		photo_alt_text: "কৃত্রিম বুদ্ধিমত্তাসম্পন্ন নৌযান",
		seo_title: "কৃত্রিম বুদ্ধিমত্তাসম্পন্ন নৌযান",
		seo_keyword: "কৃত্রিম বুদ্ধিমত্তাসম্পন্ন নৌযান",
		seo_description: "কৃত্রিম বুদ্ধিমত্তাসম্পন্ন নৌযান",
		seo_schema_tags: "কৃত্রিম বুদ্ধিমত্তাসম্পন্ন নৌযান",
		published_date: "2023-06-14",
		categories: [],
		status: true,

	},
];

const run = async () => mongoose.connect(db_url)
	.then(async () => {
		console.log("\n");
		console.log("content seeding");

		await Model.deleteMany({});
		for (let i = 0; i < data.length; i++) {
			let item = data[i]
			item.categories = await getId()
			await Model.create(item);
		}

		// let response = await Model.insertMany(data);

		console.log("content seeding complete");

		console.log("\n");
	});
module.exports = async () => run()
